{
    "apple pie": "A sweet pie filled with spiced apples.",
    "baby back ribs": "Tender ribs cooked with barbecue sauce.",
    "baklava": "A sweet pastry made with layers of nuts and honey.",
    "beef carpaccio": "Thinly sliced raw beef served with olive oil.",
    "beef tartare": "Raw minced beef mixed with seasonings.",
    "beet salad": "A salad with cooked beets and greens.",
    "beignets": "Deep-fried dough topped with powdered sugar.",
    "bibimbap": "A Korean rice dish with vegetables and meat.",
    "bread pudding": "A dessert made with bread soaked in custard.",
    "breakfast burrito": "A tortilla filled with eggs and breakfast ingredients.",
    "bruschetta": "Grilled bread topped with tomatoes and basil.",
    "caesar salad": "A salad with romaine, croutons, and Caesar dressing.",
    "cannoli": "A crispy pastry filled with sweet ricotta cheese.",
    "caprese salad": "A salad with tomatoes, mozzarella, and basil.",
    "carrot cake": "A spiced cake made with grated carrots and frosting.",
    "ceviche": "Raw fish marinated in citrus and spices.",
    "cheese plate": "An assortment of different cheeses.",
    "cheesecake": "A creamy dessert with a graham cracker crust.",
    "chicken curry": "A dish with chicken cooked in spiced curry sauce.",
    "chicken quesadilla": "A grilled tortilla filled with cheese and chicken.",
    "chicken wings": "Fried or baked wings with various sauces.",
    "chocolate cake": "A rich cake made with chocolate.",
    "chocolate mousse": "A light, creamy dessert made with chocolate.",
    "churros": "Fried dough sticks rolled in cinnamon sugar.",
    "clam chowder": "A creamy soup with clams and potatoes.",
    "club sandwich": "A layered sandwich with turkey, bacon, and lettuce.",
    "crab cakes": "Fried patties made with crab meat.",
    "creme brulee": "A dessert with a caramelized sugar top and custard base.",
    "croque madame": "A French sandwich with ham, cheese, and a fried egg.",
    "cup cakes": "Small, individual cakes with frosting.",
    "deviled eggs": "Hard-boiled eggs filled with seasoned yolk mixture.",
    "donuts": "Fried dough rings, often topped with sugar or glaze.",
    "dumplings": "Dough filled with meat or vegetables, steamed or fried.",
    "edamame": "Steamed soybeans served with salt.",
    "eggs benedict": "Poached eggs on an English muffin with hollandaise sauce.",
    "escargots": "Cooked snails served with garlic butter.",
    "falafel": "Fried balls made from chickpeas or fava beans.",
    "filet mignon": "A tender cut of beef steak.",
    "fish and chips": "Fried fish served with fries.",
    "foie gras": "A rich dish made from the liver of a fattened duck or goose.",
    "french fries": "Deep-fried potato strips.",
    "french onion soup": "A soup with caramelized onions and melted cheese.",
    "french toast": "Bread soaked in egg and fried, often topped with syrup.",
    "fried calamari": "Deep-fried squid rings.",
    "fried rice": "Stir-fried rice with vegetables and meat or seafood.",
    "frozen yogurt": "A cold dessert made from yogurt.",
    "garlic bread": "Bread topped with garlic butter and baked.",
    "gnocchi": "Small potato dumplings served with sauce.",
    "greek salad": "A salad with cucumber, tomatoes, olives, and feta cheese.",
    "grilled cheese sandwich": "A sandwich with melted cheese between grilled bread.",
    "grilled salmon": "Salmon fillet cooked on a grill.",
    "guacamole": "A dip made from mashed avocado and lime.",
    "gyoza": "Japanese dumplings filled with meat or vegetables.",
    "hamburger": "A grilled beef patty in a bun.",
    "hot and sour soup": "A spicy and tangy soup, often with tofu and mushrooms.",
    "hot dog": "A cooked sausage served in a bun.",
    "huevos rancheros": "Eggs served on tortillas with salsa.",
    "hummus": "A creamy dip made from chickpeas and tahini.",
    "ice cream": "A frozen dessert made from cream and sugar.",
    "lasagna": "Layers of pasta, cheese, and sauce baked together.",
    "lobster bisque": "A creamy soup made from lobster.",
    "lobster roll sandwich": "A sandwich filled with lobster meat.",
    "macaroni and cheese": "Pasta mixed with creamy cheese sauce.",
    "macarons": "Small meringue-based cookies with filling.",
    "miso soup": "A Japanese soup made with fermented soybean paste.",
    "mussels": "Steamed or cooked shellfish served with broth or sauce.",
    "nachos": "Tortilla chips topped with cheese and other ingredients.",
    "omelette": "Eggs cooked and folded around a filling.",
    "onion rings": "Battered and fried onion slices.",
    "oysters": "Shellfish served raw or cooked.",
    "pad thai": "A Thai stir-fried noodle dish with vegetables and meat.",
    "paella": "A Spanish rice dish with seafood and saffron.",
    "pancakes": "Flat cakes made from a batter, often served with syrup.",
    "panna cotta": "An Italian creamy dessert made with gelatin.",
    "peking duck": "A Chinese dish with crispy duck skin and pancakes.",
    "pho": "A Vietnamese soup with noodles and meat.",
    "pizza": "A baked dish with dough, sauce, cheese, and toppings.",
    "pork chop": "A cut of pork meat, often grilled or fried.",
    "poutine": "Fries topped with cheese curds and gravy.",
    "prime rib": "A tender cut of beef, roasted and served in slices.",
    "pulled pork sandwich": "A sandwich with slow-cooked, shredded pork.",
    "ramen": "A Japanese noodle soup with meat and vegetables.",
    "ravioli": "Pasta filled with meat or cheese, served with sauce.",
    "red velvet cake": "A chocolate-flavored cake with red coloring and cream cheese frosting.",
    "risotto": "A creamy Italian rice dish cooked in broth.",
    "samosa": "A fried pastry filled with spiced potatoes or meat.",
    "sashimi": "Thinly sliced raw fish.",
    "scallops": "Shellfish with a sweet, tender texture.",
    "seaweed salad": "A salad made from marinated seaweed.",
    "shrimp and grits": "A Southern dish with shrimp served over creamy corn grits.",
    "spaghetti bolognese": "Pasta served with a meat-based tomato sauce.",
    "spaghetti carbonara": "Pasta with eggs, cheese, and pancetta.",
    "spring rolls": "Vegetables or meat wrapped in rice paper and fried.",
    "steak": "A thick cut of beef, grilled or fried.",
    "strawberry shortcake": "A dessert made with strawberries and whipped cream.",
    "sushi": "Vinegared rice with raw fish and other toppings.",
    "tacos": "Tortillas filled with meat, cheese, and vegetables.",
    "takoyaki": "Japanese octopus balls cooked in batter.",
    "tiramisu": "An Italian dessert with layers of coffee-soaked cake and mascarpone.",
    "tuna tartare": "Raw, minced tuna mixed with seasonings.",
    "waffles": "A breakfast dish with a grid-like pattern, often served with syrup."
}
