{
    "tench": "A freshwater fish with a thick, rounded body.",
    "goldfish": "A small, golden-colored freshwater fish.",
    "great white shark": "A large, predatory shark with sharp teeth.",
    "tiger shark": "A large shark with dark stripes on its body.",
    "hammerhead shark": "A shark with a hammer-shaped head.",
    "electric ray": "A ray that produces electric shocks to stun prey.",
    "stingray": "A flat fish with a long, venomous tail.",
    "rooster": "A male chicken, known for its crowing.",
    "hen": "A female chicken, often laying eggs.",
    "ostrich": "A large flightless bird with long legs.",
    "brambling": "A small finch with orange and black markings.",
    "goldfinch": "A small songbird with yellow and black feathers.",
    "house finch": "A small bird with red plumage on the head and chest.",
    "junco": "A small bird with gray or brown feathers.",
    "indigo bunting": "A small bird with bright blue feathers.",
    "American robin": "A common bird with a red breast.",
    "bulbul": "A tropical songbird with a soft call.",
    "jay": "A noisy, colorful bird with a crest.",
    "magpie": "A black and white bird known for its intelligence.",
    "chickadee": "A small bird with a black cap and bib.",
    "American dipper": "A small, gray bird that dives into streams.",
    "kite (bird of prey)": "A bird of prey with long wings and tail.",
    "bald eagle": "A large bird of prey with a white head.",
    "vulture": "A large bird that feeds on carrion.",
    "great grey owl": "A large owl with a round face and yellow eyes.",
    "fire salamander": "A black amphibian with yellow spots.",
    "smooth newt": "A small amphibian with smooth skin.",
    "newt": "A small, aquatic amphibian with a long tail.",
    "spotted salamander": "A salamander with black skin and yellow spots.",
    "axolotl": "A salamander that retains its gills throughout life.",
    "American bullfrog": "A large frog with a deep, resonant call.",
    "tree frog": "A small frog that lives in trees.",
    "tailed frog": "A frog with a small tail-like structure.",
    "loggerhead sea turtle": "A large sea turtle with a reddish-brown shell.",
    "leatherback sea turtle": "A large sea turtle with a leathery shell.",
    "mud turtle": "A small freshwater turtle with a domed shell.",
    "terrapin": "A turtle that lives in freshwater or brackish water.",
    "box turtle": "A small turtle with a hinged shell for protection.",
    "banded gecko": "A small lizard with distinct banded markings.",
    "green iguana": "A large green lizard often kept as a pet.",
    "Carolina anole": "A small green or brown lizard.",
    "desert grassland whiptail lizard": "A slender lizard that lives in desert grasslands.",
    "agama": "A lizard with a colorful body and head.",
    "frilled-necked lizard": "A lizard with a large frill around its neck.",
    "alligator lizard": "A lizard with a long body and short legs.",
    "Gila monster": "A venomous lizard with a black and orange pattern.",
    "European green lizard": "A large, green lizard native to Europe.",
    "chameleon": "A lizard known for changing its skin color.",
    "Komodo dragon": "The largest living lizard, found in Indonesia.",
    "Nile crocodile": "A large crocodile found in Africa.",
    "American alligator": "A large reptile with a broad snout, found in the U.S.",
    "triceratops": "A herbivorous dinosaur with three horns.",
    "worm snake": "A small, slender snake that resembles a worm.",
    "ring-necked snake": "A small snake with a ring around its neck.",
    "eastern hog-nosed snake": "A snake with an upturned snout.",
    "smooth green snake": "A small, green, non-venomous snake.",
    "kingsnake": "A non-venomous snake known for eating other snakes.",
    "garter snake": "A common, non-venomous snake.",
    "water snake": "A snake that lives in or near water.",
    "vine snake": "A slender, green snake that resembles a vine.",
    "night snake": "A small, nocturnal, non-venomous snake.",
    "boa constrictor": "A large snake that kills by constriction.",
    "African rock python": "A large, non-venomous snake found in Africa.",
    "Indian cobra": "A venomous snake with a hooded appearance.",
    "green mamba": "A venomous, fast-moving green snake.",
    "sea snake": "A highly venomous snake that lives in the ocean.",
    "Saharan horned viper": "A venomous snake with horn-like structures on its head.",
    "eastern diamondback rattlesnake": "A venomous snake with a diamond pattern on its back.",
    "sidewinder rattlesnake": "A snake that moves sideways in desert sand.",
    "trilobite": "An extinct marine arthropod with a segmented body.",
    "harvestman": "An arachnid also known as a daddy longlegs.",
    "scorpion": "An arachnid with pincers and a venomous sting.",
    "yellow garden spider": "A large spider with yellow and black markings.",
    "barn spider": "A common spider that builds webs in barns.",
    "European garden spider": "A spider that spins large, circular webs.",
    "southern black widow": "A venomous spider with a red hourglass on its abdomen.",
    "tarantula": "A large, hairy spider.",
    "wolf spider": "A fast-moving spider that hunts prey on the ground.",
    "tick": "A small arachnid that feeds on blood.",
    "centipede": "A multi-legged arthropod with venomous claws.",
    "black grouse": "A large, black bird found in Europe and Asia.",
    "ptarmigan": "A bird that changes color with the seasons.",
    "ruffed grouse": "A bird known for its drumming sound during mating.",
    "prairie grouse": "A ground-dwelling bird native to prairies.",
    "peafowl": "A bird known for its colorful tail feathers.",
    "quail": "A small, ground-dwelling bird.",
    "partridge": "A bird often associated with game hunting.",
    "african grey parrot": "A highly intelligent, talking parrot.",
    "macaw": "A large, colorful parrot from the Americas.",
    "sulphur-crested cockatoo": "A white cockatoo with a yellow crest.",
    "lorikeet": "A small, colorful parrot with a brush-tipped tongue.",
    "coucal": "A large, ground-dwelling bird with a long tail.",
    "bee eater": "A brightly colored bird that feeds on bees and insects.",
    "hornbill": "A bird with a large, curved bill.",
    "hummingbird": "A tiny bird that hovers while feeding on nectar.",
    "jacamar": "A slender bird with a long bill, found in tropical forests.",
    "toucan": "A bird with a large, colorful beak.",
    "duck": "A waterfowl with webbed feet and a broad bill.",
    "red-breasted merganser": "A diving duck with a thin, serrated bill.",
    "goose": "A large waterfowl with a long neck.",
    "black swan": "A large waterbird with black feathers.",
    "tusker": "An elephant with large tusks.",
    "echidna": "A spiny, egg-laying mammal.",
    "platypus": "A mammal with a duck-like bill and webbed feet.",
    "wallaby": "A small kangaroo-like marsupial.",
    "koala": "A tree-dwelling marsupial that eats eucalyptus leaves.",
    "wombat": "A burrowing marsupial with a sturdy body.",
    "jellyfish": "A soft-bodied marine animal with tentacles.",
    "sea anemone": "A flower-like marine animal with tentacles.",
    "brain coral": "A hard coral resembling a brain in shape.",
    "flatworm": "A simple, flat-bodied worm.",
    "nematode": "A small, unsegmented worm.",
    "conch": "A large sea snail with a spiral shell.",
    "snail": "A mollusk with a coiled shell.",
    "slug": "A shell-less mollusk.",
    "sea slug": "A colorful, shell-less marine mollusk.",
    "chiton": "A mollusk with a segmented shell.",
    "chambered nautilus": "A marine mollusk with a coiled shell.",
    "Dungeness crab": "A large, edible crab found on the West Coast.",
    "rock crab": "A crab with a hard shell found near rocky shores.",
    "fiddler crab": "A small crab with one oversized claw.",
    "red king crab": "A large, spiny crab from cold waters.",
    "American lobster": "A large crustacean with big claws.",
    "spiny lobster": "A lobster with long, spiny antennae.",
    "crayfish": "A freshwater crustacean resembling a small lobster.",
    "hermit crab": "A crab that lives in a discarded shell.",
    "isopod": "A small crustacean with a flattened body.",
    "white stork": "A large bird with long legs and a white body.",
    "black stork": "A large bird with black feathers and long legs.",
    "spoonbill": "A bird with a long, spoon-shaped bill.",
    "flamingo": "A tall bird with pink feathers and long legs.",
    "little blue heron": "A small heron with blue-gray feathers.",
    "great egret": "A large white heron with long legs.",
    "bittern bird": "A small heron with a streaked appearance.",
    "crane bird": "A tall bird with long legs and a long neck.",
    "limpkin": "A wading bird with a brown, streaked body.",
    "common gallinule": "A water bird with a red beak and black body.",
    "American coot": "A small water bird with a white beak.",
    "bustard": "A large, ground-dwelling bird.",
    "ruddy turnstone": "A small bird with a short, upturned bill.",
    "dunlin": "A small wading bird with a long beak.",
    "common redshank": "A wading bird with red legs and a long beak.",
    "dowitcher": "A shorebird with a long, straight beak.",
    "oystercatcher": "A bird with a long, orange beak used for opening shells.",
    "pelican": "A large water bird with a long beak and throat pouch.",
    "king penguin": "A large penguin with bright orange markings.",
    "albatross": "A large seabird with long wings.",
    "grey whale": "A large baleen whale with a gray body.",
    "killer whale": "A large, black-and-white predatory whale.",
    "dugong": "A large marine mammal related to the manatee.",
    "sea lion": "A marine mammal with external ear flaps.",
    "Chihuahua": "A small dog breed with a short coat.",
    "Japanese Chin": "A small dog with a silky coat and pushed-in face.",
    "Maltese": "A small dog with a long, silky white coat.",
    "Pekingese": "A small dog with a long, flowing coat and a flat face.",
    "Shih Tzu": "A small dog with a long, flowing coat.",
    "King Charles Spaniel": "A small dog with a silky coat and droopy ears.",
    "Papillon": "A small dog with large, butterfly-like ears.",
    "toy terrier": "A small, active dog breed.",
    "Rhodesian Ridgeback": "A large dog with a distinctive ridge of hair on its back.",
    "Afghan Hound": "A tall dog with long, flowing fur.",
    "Basset Hound": "A dog with long ears and short legs.",
    "Beagle": "A small hound dog with a keen sense of smell.",
    "Bloodhound": "A large dog known for its strong tracking abilities.",
    "Bluetick Coonhound": "A large hound with a blue-ticked coat.",
    "Black and Tan Coonhound": "A large hound with black and tan markings.",
    "Treeing Walker Coonhound": "A hound breed known for its hunting skills.",
    "English foxhound": "A large hound bred for hunting foxes.",
    "Redbone Coonhound": "A large hound with a red coat.",
    "borzoi": "A tall, slender dog with a long snout.",
    "Irish Wolfhound": "A very large dog bred for hunting wolves.",
    "Italian Greyhound": "A small, slender dog with a short coat.",
    "Whippet": "A small, fast dog resembling a greyhound.",
    "Ibizan Hound": "A tall, slender dog with large ears.",
    "Norwegian Elkhound": "A medium-sized dog bred for hunting elk.",
    "Otterhound": "A large, shaggy dog bred for hunting otters.",
    "Saluki": "A tall, slender dog with a graceful appearance.",
    "Scottish Deerhound": "A large, wiry-coated dog bred for hunting deer.",
    "Weimaraner": "A large, sleek dog with a gray coat.",
    "Staffordshire Bull Terrier": "A muscular dog with a strong build.",
    "American Staffordshire Terrier": "A strong, muscular terrier breed.",
    "Bedlington Terrier": "A small terrier with a lamb-like appearance.",
    "Border Terrier": "A small, wiry-coated terrier breed.",
    "Kerry Blue Terrier": "A medium-sized terrier with a blue-gray coat.",
    "Irish Terrier": "A medium-sized terrier with a wiry, red coat.",
    "Norfolk Terrier": "A small terrier with a wiry coat.",
    "Norwich Terrier": "A small terrier with pointed ears.",
    "Yorkshire Terrier": "A small dog with a long, silky coat.",
    "Wire Fox Terrier": "A small terrier with a wiry coat.",
    "Lakeland Terrier": "A small terrier with a wiry coat.",
    "Sealyham Terrier": "A small, sturdy terrier with a wiry coat.",
    "Airedale Terrier": "The largest of the terrier breeds, with a wiry coat.",
    "Cairn Terrier": "A small, sturdy terrier with a shaggy coat.",
    "Australian Terrier": "A small, wiry-coated terrier from Australia.",
    "Dandie Dinmont Terrier": "A small terrier with a long body and short legs.",
    "Boston Terrier": "A small, muscular dog with a short coat.",
    "Miniature Schnauzer": "A small dog with a wiry coat and bushy eyebrows.",
    "Giant Schnauzer": "A large dog with a wiry coat.",
    "Standard Schnauzer": "A medium-sized dog with a wiry coat.",
    "Scottish Terrier": "A small dog with a wiry coat and pointed ears.",
    "Tibetan Terrier": "A medium-sized dog with a long, shaggy coat.",
    "Australian Silky Terrier": "A small terrier with a silky, fine coat.",
    "Soft-coated Wheaten Terrier": "A medium-sized terrier with a soft, wavy coat.",
    "West Highland White Terrier": "A small terrier with a white, wiry coat.",
    "Lhasa Apso": "A small dog with a long, flowing coat.",
    "Flat-Coated Retriever": "A medium-large dog with a shiny, flat coat.",
    "Curly-coated Retriever": "A large dog with a curly coat.",
    "Golden Retriever": "A large dog with a thick, golden coat.",
    "Labrador Retriever": "A large dog with a short coat, known for retrieving.",
    "Chesapeake Bay Retriever": "A large retriever with a thick, waterproof coat.",
    "German Shorthaired Pointer": "A large dog with a short coat and strong hunting instincts.",
    "Vizsla": "A medium-large dog with a short, rust-colored coat.",
    "English Setter": "A large bird dog with a long, silky coat.",
    "Irish Setter": "A large dog with a rich, reddish coat.",
    "Gordon Setter": "A large dog with a black and tan coat.",
    "Brittany dog": "A medium-sized dog known for hunting birds.",
    "Clumber Spaniel": "A large, heavy-boned spaniel with a white coat.",
    "English Springer Spaniel": "A medium-sized spaniel known for its energy.",
    "Welsh Springer Spaniel": "A medium-sized spaniel with a red and white coat.",
    "Cocker Spaniel": "A small spaniel with a long, silky coat.",
    "Sussex Spaniel": "A medium-sized spaniel with a golden-liver coat.",
    "Irish Water Spaniel": "A large, curly-coated spaniel.",
    "Kuvasz": "A large, white Hungarian livestock guardian dog.",
    "Schipperke": "A small, black Belgian dog with a fox-like face.",
    "Groenendael dog": "A Belgian herding dog with a long, black coat.",
    "Malinois": "A Belgian herding dog with a short coat.",
    "Briard": "A large, shaggy French herding dog.",
    "Australian Kelpie": "A medium-sized herding dog from Australia.",
    "Komondor": "A large Hungarian livestock guardian with corded fur.",
    "Old English Sheepdog": "A large dog with a long, shaggy coat.",
    "Shetland Sheepdog": "A small herding dog with a thick coat.",
    "collie": "A medium-sized herding dog with a long or short coat.",
    "Border Collie": "A medium-sized herding dog known for its intelligence.",
    "Bouvier des Flandres dog": "A large, rugged herding dog.",
    "Rottweiler": "A large, strong dog with a black and tan coat.",
    "German Shepherd Dog": "A large, intelligent herding dog.",
    "Dobermann": "A large, sleek dog known for its guarding abilities.",
    "Miniature Pinscher": "A small dog with a sleek coat, resembling a Dobermann.",
    "Greater Swiss Mountain Dog": "A large, tri-colored dog bred for draft work.",
    "Bernese Mountain Dog": "A large, tri-colored dog known for its calm demeanor.",
    "Appenzeller Sennenhund": "A medium-sized Swiss herding dog.",
    "Entlebucher Sennenhund": "The smallest of the Swiss Mountain dogs, used for herding.",
    "Boxer": "A medium-large, muscular dog with a short coat.",
    "Bullmastiff": "A large, muscular guard dog with a short coat.",
    "Tibetan Mastiff": "A large, powerful guard dog with a thick coat.",
    "French Bulldog": "A small, muscular dog with bat-like ears.",
    "Great Dane": "One of the largest dog breeds with a sleek coat.",
    "St. Bernard": "A large, gentle dog known for its rescue work in the mountains.",
    "husky": "A medium-sized, thick-coated sled dog.",
    "Alaskan Malamute": "A large, powerful sled dog with a thick coat.",
    "Siberian Husky": "A medium-sized sled dog with a thick coat.",
    "Dalmatian": "A medium-sized dog with a white coat covered in black spots.",
    "Affenpinscher": "A small, wiry-coated dog with a monkey-like face.",
    "Basenji": "A small, barkless dog from Africa.",
    "pug": "A small dog with a wrinkled face and short coat.",
    "Leonberger": "A giant dog breed with a lion-like mane.",
    "Newfoundland dog": "A giant, gentle dog known for water rescues.",
    "Great Pyrenees dog": "A large, white livestock guardian dog.",
    "Samoyed": "A medium-large dog with a fluffy white coat.",
    "Pomeranian": "A small, fluffy dog with a thick coat.",
    "Chow Chow": "A medium-sized dog with a thick coat and blue-black tongue.",
    "Keeshond": "A medium-sized dog with a thick coat and fox-like face.",
    "brussels griffon": "A small, sturdy dog with a bearded face.",
    "Pembroke Welsh Corgi": "A small herding dog with short legs and no tail.",
    "Cardigan Welsh Corgi": "A small herding dog with short legs and a tail.",
    "Toy Poodle": "The smallest variety of poodle, with a curly coat.",
    "Miniature Poodle": "A medium-sized poodle with a curly coat.",
    "Standard Poodle": "The largest poodle breed with a curly coat.",
    "Mexican hairless dog (xoloitzcuintli)": "A small to medium-sized hairless dog breed.",
    "grey wolf": "The largest wild member of the dog family.",
    "Alaskan tundra wolf": "A subspecies of grey wolf found in the tundra.",
    "red wolf or maned wolf": "A medium-sized wild canid with reddish fur.",
    "coyote": "A medium-sized wild canid known for its adaptability.",
    "dingo": "A wild dog found in Australia.",
    "dhole": "A wild dog native to Asia, known for its social behavior.",
    "African wild dog": "A wild dog with large ears and a spotted coat.",
    "hyena": "A large carnivore known for its powerful jaws.",
    "red fox": "A small wild canid with a red coat.",
    "kit fox": "A small wild canid with large ears.",
    "Arctic fox": "A small wild canid with a thick white coat.",
    "grey fox": "A small wild canid with a grey coat.",
    "tabby cat": "A domestic cat with a striped coat.",
    "tiger cat": "A domestic cat with tiger-like stripes.",
    "Persian cat": "A domestic cat with a long, thick coat.",
    "Siamese cat": "A domestic cat with a short coat and striking blue eyes.",
    "Egyptian Mau": "A domestic cat with a spotted coat.",
    "cougar": "A large wild cat found in the Americas.",
    "lynx": "A medium-sized wild cat with tufted ears.",
    "leopard": "A large wild cat with a spotted coat.",
    "snow leopard": "A large wild cat adapted to cold, mountainous regions.",
    "jaguar": "A large wild cat with a rosette-patterned coat.",
    "lion": "A large wild cat known for its mane.",
    "tiger": "A large wild cat with a striped coat.",
    "cheetah": "A large wild cat known for its speed.",
    "brown bear": "A large bear species with a brown coat.",
    "American black bear": "A large bear species with a black coat.",
    "polar bear": "A large bear species adapted to the Arctic.",
    "sloth bear": "A bear species known for its shaggy coat and long claws.",
    "mongoose": "A small carnivorous mammal known for hunting snakes.",
    "meerkat": "A small, social mammal that lives in desert regions.",
    "tiger beetle": "A fast-moving beetle known for its predatory behavior.",
    "ladybug": "A small beetle with a red and black-spotted shell.",
    "ground beetle": "A beetle that lives and hunts on the ground.",
    "longhorn beetle": "A beetle with long antennae.",
    "leaf beetle": "A small beetle that feeds on leaves.",
    "dung beetle": "A beetle that feeds on animal dung.",
    "rhinoceros beetle": "A large beetle with a horn-like structure.",
    "weevil": "A small beetle with a long snout.",
    "fly": "A small insect with two wings.",
    "bee": "An insect known for pollination and honey production.",
    "ant": "A small social insect that lives in colonies.",
    "grasshopper": "An insect that jumps and feeds on plants.",
    "cricket insect": "An insect known for its chirping sound.",
    "stick insect": "An insect that resembles a twig for camouflage.",
    "cockroach": "A nocturnal insect known for its hardiness.",
    "praying mantis": "An insect known for its predatory hunting stance.",
    "cicada": "An insect known for its loud buzzing sound.",
    "leafhopper": "A small jumping insect that feeds on plant sap.",
    "lacewing": "An insect with delicate, lace-like wings.",
    "dragonfly": "A fast-flying insect with long, slender wings.",
    "damselfly": "A slender, delicate relative of the dragonfly.",
    "red admiral butterfly": "A butterfly with red and black wings.",
    "ringlet butterfly": "A brown butterfly with ring-like markings.",
    "monarch butterfly": "A large, orange and black migratory butterfly.",
    "small white butterfly": "A common butterfly with white wings.",
    "sulphur butterfly": "A yellow or orange butterfly.",
    "gossamer-winged butterfly": "A small butterfly with delicate wings.",
    "starfish": "A sea creature with five arms.",
    "sea urchin": "A spiny sea creature.",
    "sea cucumber": "A soft-bodied sea animal.",
    "cottontail rabbit": "A small rabbit with a fluffy white tail.",
    "hare": "A larger, fast-running relative of the rabbit.",
    "Angora rabbit": "A rabbit with long, soft fur.",
    "hamster": "A small, burrowing rodent.",
    "porcupine": "A rodent with sharp quills for defense.",
    "fox squirrel": "A large tree squirrel with a bushy tail.",
    "marmot": "A large ground-dwelling rodent.",
    "beaver": "A large rodent known for building dams.",
    "guinea pig": "A small, social rodent often kept as a pet.",
    "common sorrel horse": "A horse with a reddish-brown coat.",
    "zebra": "A wild horse with black and white stripes.",
    "pig": "A domesticated animal raised for meat.",
    "wild boar": "A wild ancestor of the domestic pig.",
    "warthog": "A wild pig with large tusks.",
    "hippopotamus": "A large, semi-aquatic mammal with a huge mouth.",
    "ox": "A domesticated bovine used for heavy labor.",
    "water buffalo": "A large, domesticated bovine found in Asia.",
    "bison": "A large, shaggy wild bovine.",
    "ram (adult male sheep)": "An adult male sheep.",
    "bighorn sheep": "A wild sheep with large, curved horns.",
    "Alpine ibex": "A wild goat with long, curved horns.",
    "hartebeest": "A large African antelope.",
    "impala (antelope)": "A fast, graceful African antelope.",
    "gazelle": "A small, slender antelope.",
    "arabian camel": "A large desert animal with one hump.",
    "llama": "A domesticated South American pack animal.",
    "weasel": "A small, slender carnivorous mammal.",
    "mink": "A small, semi-aquatic mammal with soft fur.",
    "European polecat": "A wild carnivore related to the ferret.",
    "black-footed ferret": "A small, endangered ferret species.",
    "otter": "A playful, semi-aquatic mammal.",
    "skunk": "A small mammal known for its foul-smelling spray.",
    "badger": "A burrowing mammal with a strong build.",
    "armadillo": "A small, armored mammal.",
    "three-toed sloth": "A slow-moving, tree-dwelling mammal.",
    "orangutan": "A large, orange-colored ape.",
    "gorilla": "A large, powerful ape.",
    "chimpanzee": "A highly intelligent ape closely related to humans.",
    "gibbon": "A small, agile ape known for its long arms.",
    "siamang": "A large gibbon with a throat pouch for vocalizing.",
    "guenon": "A small, agile monkey from Africa.",
    "patas monkey": "A fast-running monkey from Africa.",
    "baboon": "A large, ground-dwelling monkey.",
    "macaque": "A medium-sized monkey found in Asia.",
    "langur": "A slender, long-tailed monkey.",
    "black-and-white colobus": "A large African monkey with black and white fur.",
    "proboscis monkey": "A monkey with a large, distinctive nose.",
    "marmoset": "A small, tree-dwelling monkey.",
    "white-headed capuchin": "A small, intelligent monkey from Central and South America.",
    "howler monkey": "A large monkey known for its loud calls.",
    "titi monkey": "A small, South American monkey.",
    "Geoffroy's spider monkey": "A large, agile monkey with long limbs.",
    "common squirrel monkey": "A small, social monkey from South America.",
    "ring-tailed lemur": "A lemur with a long, striped tail.",
    "indri": "A large, tree-dwelling lemur.",
    "Asian elephant": "A large, herbivorous mammal with a trunk.",
    "African bush elephant": "The largest land animal, with large ears and a trunk.",
    "red panda": "A small, tree-dwelling mammal with reddish fur.",
    "giant panda": "A large bear-like mammal known for eating bamboo.",
    "snoek fish": "A long, slender fish found in cold waters.",
    "eel": "A long, snake-like fish.",
    "silver salmon": "A fish known for its silvery body.",
    "rock beauty fish": "A brightly colored tropical fish.",
    "clownfish": "A small, colorful fish that lives in anemones.",
    "sturgeon": "A large, ancient fish species.",
    "gar fish": "A long, slender fish with sharp teeth.",
    "lionfish": "A venomous fish with spiky fins.",
    "pufferfish": "A fish that inflates when threatened.",
    "abacus": "An ancient counting tool with sliding beads.",
    "abaya": "A long, flowing garment worn by some Muslim women.",
    "academic gown": "A robe worn during academic ceremonies.",
    "accordion": "A portable musical instrument with keys and bellows.",
    "acoustic guitar": "A string instrument that produces sound acoustically.",
    "aircraft carrier": "A warship that serves as a base for aircraft.",
    "airliner": "A large airplane used for commercial flights.",
    "airship": "A lighter-than-air aircraft, like a blimp.",
    "altar": "A table or platform used in religious ceremonies.",
    "ambulance": "A vehicle used to transport people in need of medical care.",
    "amphibious vehicle": "A vehicle that can travel on land and water.",
    "analog clock": "A clock with hands that move to show the time.",
    "apiary": "A place where beehives are kept for honey production.",
    "apron": "A protective garment worn over clothes.",
    "trash can": "A container for holding garbage.",
    "assault rifle": "A rapid-fire rifle designed for military use.",
    "backpack": "A bag worn on the back, used for carrying items.",
    "bakery": "A shop where bread and cakes are made and sold.",
    "balance beam": "A narrow beam used in gymnastics.",
    "balloon": "A flexible bag filled with air or gas.",
    "ballpoint pen": "A pen with a tiny ball at the tip for ink flow.",
    "Band-Aid": "A small adhesive bandage used for minor injuries.",
    "banjo": "A stringed musical instrument with a round body.",
    "baluster / handrail": "A vertical post that supports a handrail.",
    "barbell": "A long bar with weights on either end for lifting.",
    "barber chair": "A chair used in barbershops for cutting hair.",
    "barbershop": "A place where men's hair is cut and styled.",
    "barn": "A large building used for storing farm equipment and animals.",
    "barometer": "An instrument used to measure atmospheric pressure.",
    "barrel": "A cylindrical container used for storing liquids.",
    "wheelbarrow": "A small hand-propelled vehicle for carrying loads.",
    "baseball": "A ball used in the sport of baseball.",
    "basketball": "A large ball used in the sport of basketball.",
    "bassinet": "A small bed for a baby, often with a hood.",
    "bassoon": "A large woodwind instrument with a deep sound.",
    "swimming cap": "A tight-fitting cap worn in water to protect hair.",
    "bath towel": "A large towel used for drying the body after bathing.",
    "bathtub": "A large container for taking baths.",
    "station wagon": "A car with a large rear storage area.",
    "lighthouse": "A tall structure with a light to guide ships.",
    "beaker": "A cylindrical glass container used in laboratories.",
    "military hat (bearskin or shako)": "A ceremonial hat worn by soldiers.",
    "beer bottle": "A glass bottle used to hold beer.",
    "beer glass": "A glass used for drinking beer.",
    "bell tower": "A tower that houses bells, often in churches.",
    "baby bib": "A cloth worn around a baby's neck to catch food spills.",
    "tandem bicycle": "A bicycle built for two riders.",
    "bikini": "A two-piece swimsuit for women.",
    "ring binder": "A folder with rings for holding papers.",
    "binoculars": "A handheld device for viewing distant objects.",
    "birdhouse": "A small house for birds to live in.",
    "boathouse": "A building for storing boats.",
    "bobsleigh": "A long sled used for racing down icy tracks.",
    "bolo tie": "A cord fastened with an ornamental clasp, worn as a tie.",
    "poke bonnet": "A woman's bonnet with a projecting front brim.",
    "bookcase": "A piece of furniture with shelves for holding books.",
    "bookstore": "A shop that sells books.",
    "bottle cap": "A cap used to seal the top of a bottle.",
    "hunting bow": "A weapon used for shooting arrows.",
    "bow tie": "A short, ribbon-like necktie.",
    "brass memorial plaque": "A flat metal plate inscribed with a memorial.",
    "bra": "An undergarment worn by women for breast support.",
    "breakwater": "A barrier built to protect a shore from waves.",
    "breastplate": "A piece of armor that covers the chest.",
    "broom": "A tool used for sweeping floors.",
    "bucket": "A round container with a handle, used for carrying liquids.",
    "buckle": "A fastener used to secure belts or straps.",
    "bulletproof vest": "A protective vest designed to stop bullets.",
    "high-speed train": "A train that travels at very high speeds.",
    "butcher shop": "A store where meat is sold.",
    "taxicab": "A car used to transport passengers for a fare.",
    "cauldron": "A large metal pot used for cooking over an open fire.",
    "candle": "A stick of wax with a wick, used for lighting.",
    "cannon": "A large gun used in warfare.",
    "canoe": "A lightweight boat paddled by hand.",
    "can opener": "A tool used to open cans.",
    "cardigan": "A knitted sweater that opens in the front.",
    "car mirror": "A mirror on a car for viewing behind.",
    "carousel": "A rotating amusement ride with seats for passengers.",
    "tool kit": "A set of tools used for repairs or projects.",
    "cardboard box / carton": "A box made of cardboard for packaging.",
    "car wheel": "A wheel used on automobiles.",
    "automated teller machine": "A machine used for banking transactions.",
    "cassette": "A small, rectangular case containing magnetic tape.",
    "cassette player": "A device used to play cassettes.",
    "castle": "A large fortified building or group of buildings.",
    "catamaran": "A boat with two parallel hulls.",
    "CD player": "A device that plays compact discs.",
    "cello": "A large string instrument with a deep tone.",
    "mobile phone": "A handheld device used for communication.",
    "chain": "A series of connected metal links.",
    "chain-link fence": "A fence made of interlocking metal wires.",
    "chain mail": "A type of armor made from small metal rings.",
    "chainsaw": "A power tool used for cutting wood.",
    "storage chest": "A large box used for storing items.",
    "chiffonier": "A tall, narrow chest of drawers.",
    "bell or wind chime": "A decorative item that makes noise in the wind.",
    "china cabinet": "A cabinet for displaying dishes and glassware.",
    "Christmas stocking": "A decorative sock hung up for Christmas.",
    "church": "A building for Christian worship.",
    "movie theater": "A place where films are shown.",
    "cleaver": "A large knife used for chopping meat.",
    "cliff dwelling": "A house built on or in the side of a cliff.",
    "cloak": "A loose outer garment without sleeves.",
    "clogs": "Wooden or thick-soled shoes.",
    "cocktail shaker": "A container used for mixing cocktails.",
    "coffee mug": "A cup used for drinking coffee.",
    "coffeemaker": "A machine used to brew coffee.",
    "spiral or coil": "A shape made by winding in a circular pattern.",
    "combination lock": "A lock that opens with a set of numbers.",
    "computer keyboard": "A device used for typing on a computer.",
    "candy store": "A shop that sells candy and sweets.",
    "container ship": "A large ship for transporting goods in containers.",
    "convertible": "A car with a roof that can be opened or closed.",
    "corkscrew": "A tool used for opening wine bottles.",
    "cornet": "A brass musical instrument, similar to a trumpet.",
    "cowboy boot": "A tall boot worn by cowboys.",
    "cowboy hat": "A wide-brimmed hat associated with cowboys.",
    "cradle": "A small bed for an infant.",
    "construction crane": "A large machine used for lifting heavy objects on building sites.",
    "crash helmet": "A protective helmet worn to prevent injury in accidents.",
    "crate": "A large container used for transporting goods.",
    "infant bed": "A small bed designed for babies.",
    "Crock Pot": "A slow-cooking appliance.",
    "croquet ball": "A ball used in the game of croquet.",
    "crutch": "A support used to help a person walk.",
    "cuirass": "A piece of armor for the chest.",
    "dam": "A barrier built to control water flow.",
    "desk": "A table used for working or studying.",
    "desktop computer": "A personal computer designed for use on a desk.",
    "rotary dial telephone": "An old phone with a circular dial for dialing numbers.",
    "diaper": "A garment worn by babies to catch waste.",
    "digital clock": "A clock that shows time with numbers.",
    "digital watch": "A wristwatch that displays time digitally.",
    "dining table": "A table used for eating meals.",
    "dishcloth": "A cloth used for washing dishes.",
    "dishwasher": "A machine for washing dishes automatically.",
    "disc brake": "A brake that uses discs to stop a vehicle.",
    "dock": "A platform for loading or unloading ships.",
    "dog sled": "A sled pulled by dogs.",
    "dome": "A rounded roof or ceiling.",
    "doormat": "A mat placed at the entrance of a house for wiping shoes.",
    "drilling rig": "A machine used for drilling into the ground.",
    "drum": "A percussion instrument played by hitting.",
    "drumstick": "A stick used to play drums.",
    "dumbbell": "A weight used for exercise.",
    "Dutch oven": "A heavy pot used for slow cooking.",
    "electric fan": "A machine that blows air to cool a space.",
    "electric guitar": "A guitar that requires an amplifier to produce sound.",
    "electric locomotive": "A train powered by electricity.",
    "entertainment center": "A piece of furniture for holding TV and media devices.",
    "envelope": "A flat paper container used for mailing letters.",
    "espresso machine": "A machine for making espresso coffee.",
    "face powder": "A cosmetic powder used on the face.",
    "feather boa": "A long, fluffy scarf made of feathers.",
    "filing cabinet": "A cabinet for storing documents in files.",
    "fireboat": "A boat equipped to fight fires on water.",
    "fire truck": "A vehicle used by firefighters to fight fires.",
    "fire screen": "A screen placed in front of a fireplace for protection.",
    "flagpole": "A tall pole used to display a flag.",
    "flute": "A woodwind instrument played by blowing air.",
    "folding chair": "A chair that can be folded for easy storage.",
    "football helmet": "A protective helmet worn in football games.",
    "forklift": "A vehicle used for lifting heavy objects in warehouses.",
    "fountain": "A decorative water feature.",
    "fountain pen": "A pen that uses liquid ink.",
    "four-poster bed": "A bed with posts at each corner.",
    "freight car": "A train car used for transporting goods.",
    "French horn": "A brass musical instrument with a coiled tube.",
    "frying pan": "A shallow pan used for frying food.",
    "fur coat": "A coat made from animal fur.",
    "garbage truck": "A truck used for collecting and transporting waste.",
    "gas mask or respirator": "A mask worn to protect from harmful gases.",
    "gas pump": "A machine that dispenses fuel at a gas station.",
    "goblet": "A drinking glass with a stem and base.",
    "go-kart": "A small racing vehicle with an open frame.",
    "golf ball": "A small ball used in the game of golf.",
    "golf cart": "A small vehicle used to carry golfers around the course.",
    "gondola": "A long, narrow boat used in Venice.",
    "gong": "A large metal disc that makes a sound when struck.",
    "gown": "A long formal dress.",
    "grand piano": "A large, full-size piano.",
    "greenhouse": "A glass building used for growing plants.",
    "radiator grille": "The front part of a vehicle's radiator that allows airflow.",
    "grocery store": "A shop that sells food and household items.",
    "guillotine": "A machine used for execution by beheading.",
    "hair clip": "A device used to hold hair in place.",
    "hair spray": "A product used to hold hair in place.",
    "half-track": "A vehicle with wheels at the front and tracks at the back.",
    "hammer": "A tool used for driving nails into materials.",
    "hamper": "A basket for holding laundry.",
    "hair dryer": "A device used for drying hair with hot air.",
    "hand-held computer": "A small, portable computing device.",
    "handkerchief": "A small cloth used for personal hygiene.",
    "hard disk drive": "A device used for storing digital data.",
    "harmonica": "A small wind instrument played by blowing air.",
    "harp": "A large string instrument played by plucking.",
    "combine harvester": "A machine used to harvest crops.",
    "hatchet": "A small axe used for chopping.",
    "holster": "A case used for holding a gun.",
    "home theater": "A system for watching movies at home with high-quality sound and video.",
    "honeycomb": "A structure of hexagonal wax cells made by bees.",
    "hook": "A curved tool used to catch or hold things.",
    "hoop skirt": "A skirt with a frame to make it wide.",
    "gymnastic horizontal bar": "A bar used in gymnastics for swinging and tricks.",
    "horse-drawn vehicle": "A vehicle pulled by horses.",
    "hourglass": "A device that measures time using sand.",
    "iPod": "A portable music player.",
    "clothes iron": "A device used to remove wrinkles from clothes.",
    "carved pumpkin": "A pumpkin that has been cut into a design, often for Halloween.",
    "jeans": "Pants made from denim fabric.",
    "jeep": "A rugged, off-road vehicle.",
    "T-shirt": "A casual, short-sleeved shirt.",
    "jigsaw puzzle": "A puzzle made of small pieces that fit together.",
    "rickshaw": "A small vehicle pulled by a person, used for transport.",
    "joystick": "A control stick used for video games or machines.",
    "kimono": "A traditional Japanese garment.",
    "knee pad": "A protective covering for the knees.",
    "knot": "An interlacing of rope or string.",
    "lab coat": "A protective coat worn by scientists or doctors.",
    "ladle": "A large spoon used for serving soup or liquids.",
    "lampshade": "A cover for a lamp to soften or direct light.",
    "laptop computer": "A portable personal computer.",
    "lawn mower": "A machine used to cut grass.",
    "lens cap": "A cover used to protect a camera lens.",
    "letter opener": "A tool used to open envelopes.",
    "library": "A place where books and resources are stored for reading and borrowing.",
    "lifeboat": "A small boat used for emergencies at sea.",
    "lighter": "A small device used to create a flame.",
    "limousine": "A long, luxury car.",
    "ocean liner": "A large ship used for long ocean voyages.",
    "lipstick": "A cosmetic used to color the lips.",
    "slip-on shoe": "A shoe that can be worn without laces or straps.",
    "lotion": "A creamy liquid used to moisturize skin.",
    "music speaker": "A device that plays sound or music.",
    "loupe magnifying glass": "A small magnifying tool used for close inspection.",
    "sawmill": "A place where logs are cut into lumber.",
    "magnetic compass": "A device used for navigation by showing direction.",
    "messenger bag": "A shoulder bag used for carrying personal items.",
    "mailbox": "A box where mail is collected and delivered.",
    "tights": "A close-fitting garment that covers the legs and waist.",
    "one-piece bathing suit": "A single-piece swimsuit for women.",
    "manhole cover": "A heavy lid covering an access point to underground utilities.",
    "maraca": "A percussion instrument shaken to produce sound.",
    "marimba": "A musical instrument with wooden bars struck with mallets.",
    "mask": "A covering for the face, often for protection or disguise.",
    "matchstick": "A small stick used to light a fire.",
    "maypole": "A tall pole used in traditional celebrations, often decorated with ribbons.",
    "maze": "A complex network of paths designed as a puzzle.",
    "measuring cup": "A cup used to measure liquid or dry ingredients.",
    "medicine cabinet": "A small cupboard for storing medicine.",
    "megalith": "A large stone used in ancient monuments.",
    "microphone": "A device used to amplify or record sound.",
    "microwave oven": "An appliance used to cook or heat food quickly.",
    "military uniform": "The official clothing worn by members of the military.",
    "milk can": "A large container used for storing or transporting milk.",
    "minibus": "A small bus used for transporting passengers.",
    "miniskirt": "A short skirt that ends above the knees.",
    "minivan": "A small van designed for families or small groups.",
    "mitten": "A glove that covers the hand with a single space for fingers.",
    "mixing bowl": "A bowl used for combining ingredients in cooking.",
    "mobile home": "A house that can be moved from one location to another.",
    "ford model t": "An early mass-produced car made by Ford.",
    "modem": "A device that connects computers to the internet.",
    "monastery": "A building where monks live and work.",
    "monitor": "A screen used to display information from a computer.",
    "moped": "A small motorized bike.",
    "mortar and pestle": "A tool used for grinding substances in a bowl.",
    "graduation cap": "A hat worn during graduation ceremonies.",
    "mosque": "A place of worship for Muslims.",
    "mosquito net": "A net used to protect against mosquitoes.",
    "vespa": "A brand of scooter.",
    "mountain bike": "A bicycle designed for off-road cycling.",
    "tent": "A portable shelter made of fabric or material.",
    "computer mouse": "A device used to control the cursor on a computer screen.",
    "mousetrap": "A device used to catch or kill mice.",
    "moving van": "A large vehicle used for transporting belongings during a move.",
    "muzzle": "A covering for an animal's mouth to prevent biting.",
    "metal nail": "A small, sharp object used to fasten things together.",
    "neck brace": "A support worn around the neck for medical purposes.",
    "necklace": "A piece of jewelry worn around the neck.",
    "baby pacifier": "A rubber or plastic object for babies to suck on.",
    "notebook computer": "A small, portable personal computer.",
    "obelisk": "A tall, four-sided stone monument that tapers at the top.",
    "oboe": "A woodwind musical instrument with a double reed.",
    "ocarina": "A small wind instrument shaped like an oval.",
    "odometer": "A device that measures distance traveled by a vehicle.",
    "oil filter": "A filter used to remove impurities from engine oil.",
    "pipe organ": "A large musical instrument that uses pipes to produce sound.",
    "oscilloscope": "A device used to display electrical signals on a screen.",
    "overskirt": "A skirt worn over another garment.",
    "bullock cart": "A vehicle pulled by oxen.",
    "oxygen mask": "A mask worn to provide oxygen to the wearer.",
    "product packet / packaging": "A container or wrapping for products.",
    "paddle": "A tool used to propel a boat through water.",
    "paddle wheel": "A wheel with paddles used to propel a boat.",
    "padlock": "A portable lock with a shackle that can be secured.",
    "paintbrush": "A tool with bristles used for painting.",
    "pajamas": "A loose-fitting outfit worn for sleeping.",
    "palace": "A large, luxurious residence for royalty.",
    "pan flute": "a musical instrument made of multiple pipes",
    "paper towel": "absorbent disposable paper used for cleaning",
    "parachute": "device used to slow a fall from the sky",
    "parallel bars": "gymnastic equipment with two horizontal bars",
    "park bench": "outdoor seat for public spaces",
    "parking meter": "device for paying parking fees",
    "railroad car": "vehicle on a train used for transport",
    "patio": "outdoor space next to a building",
    "payphone": "public coin-operated telephone",
    "pedestal": "base for supporting a statue or object",
    "pencil case": "container for holding pencils and pens",
    "pencil sharpener": "device for sharpening pencils",
    "perfume": "fragrant liquid worn on the body",
    "Petri dish": "shallow dish used in laboratories",
    "photocopier": "machine for making paper copies of documents",
    "plectrum": "tool for plucking guitar strings",
    "Pickelhaube": "spiked helmet worn by German soldiers",
    "picket fence": "wooden fence with evenly spaced slats",
    "pickup truck": "vehicle with an open cargo area",
    "pier": "structure extending into water for docking boats",
    "piggy bank": "small container for saving coins",
    "pill bottle": "container for holding medicine",
    "pillow": "soft cushion for resting the head",
    "ping-pong ball": "small lightweight ball used in table tennis",
    "pinwheel": "toy that spins in the wind",
    "pirate ship": "vessel used by pirates for sailing and attacking",
    "drink pitcher": "container for serving liquids",
    "block plane": "tool for smoothing wood surfaces",
    "planetarium": "theater for viewing astronomical displays",
    "plastic bag": "disposable bag made of plastic",
    "plate rack": "holder for drying or displaying plates",
    "farm plow": "tool for turning soil in agriculture",
    "plunger": "tool used to unclog drains",
    "Polaroid camera": "camera that prints photos instantly",
    "pole": "long, thin structure used for support",
    "police van": "vehicle used by police for transport",
    "poncho": "garment worn for protection from rain",
    "pool table": "table used for playing billiards",
    "soda bottle": "container for storing carbonated drinks",
    "plant pot": "container for growing plants",
    "potter's wheel": "device used for shaping clay",
    "power drill": "electric tool used for drilling holes",
    "prayer rug": "small mat used for kneeling during prayer",
    "printer": "device that produces paper copies of digital files",
    "prison": "facility for holding convicted criminals",
    "missile": "guided weapon designed to hit a target",
    "projector": "device for projecting images onto a screen",
    "hockey puck": "small disc used in ice hockey",
    "punching bag": "bag used for boxing practice",
    "purse": "small bag used for carrying personal items",
    "quill": "feather used for writing in old times",
    "quilt": "warm bed covering made from fabric layers",
    "race car": "high-speed car used for racing",
    "racket": "handheld tool used in sports like tennis",
    "radiator": "device for heating a room",
    "radio": "device for receiving broadcast audio signals",
    "radio telescope": "instrument for observing radio waves from space",
    "rain barrel": "container for collecting rainwater",
    "recreational vehicle": "vehicle equipped for living while traveling",
    "fishing casting reel": "device for controlling fishing line",
    "reflex camera": "camera with a mirror for viewing through the lens",
    "refrigerator": "appliance for keeping food cold",
    "remote control": "device for operating electronics from a distance",
    "restaurant": "place where meals are served to customers",
    "revolver": "handgun with a revolving cylinder",
    "rifle": "long gun designed for precision shooting",
    "rocking chair": "chair with curved legs for rocking motion",
    "rotisserie": "cooking device that rotates food over heat",
    "eraser": "tool for removing pencil marks",
    "rugby ball": "oval ball used in the sport of rugby",
    "ruler measuring stick": "tool for measuring length",
    "sneaker": "comfortable shoe used for sports or casual wear",
    "safe": "secure container for valuables",
    "safety pin": "pin used for fastening clothing or fabric",
    "salt shaker": "container for dispensing salt",
    "sandal": "open-toe footwear with straps",
    "sarong": "long piece of fabric worn as a garment",
    "saxophone": "wind instrument used in jazz and classical music",
    "scabbard": "sheath for holding a sword",
    "weighing scale": "device used to measure weight",
    "school bus": "vehicle for transporting students",
    "schooner": "large sailing ship with multiple masts",
    "scoreboard": "board displaying scores in a game",
    "CRT monitor": "old-style computer screen using cathode ray tubes",
    "screw": "metal fastener with a spiral thread",
    "screwdriver": "tool for turning screws",
    "seat belt": "safety device used in vehicles",
    "sewing machine": "device used for stitching fabric",
    "shield": "protective device used in combat",
    "shoe store": "shop selling footwear",
    "shoji screen / room divider": "Japanese sliding door made of wood and paper",
    "shopping basket": "basket for carrying items while shopping",
    "shopping cart": "wheeled cart for carrying items in stores",
    "shovel": "tool used for digging",
    "shower cap": "plastic cap worn to keep hair dry in the shower",
    "shower curtain": "curtain used to prevent water from splashing in a shower",
    "ski": "long, narrow equipment used for sliding on snow",
    "balaclava ski mask": "close-fitting head covering for cold weather",
    "sleeping bag": "portable insulated bag for sleeping outdoors",
    "slide rule": "analog device used for mathematical calculations",
    "sliding door": "door that moves horizontally on a track",
    "slot machine": "gambling machine operated by inserting coins",
    "snorkel": "breathing tube used for swimming underwater",
    "snowmobile": "vehicle used for traveling over snow",
    "snowplow": "vehicle or device for clearing snow",
    "soap dispenser": "device for dispensing liquid soap",
    "soccer ball": "round ball used in the sport of soccer",
    "sock": "garment worn on the foot",
    "solar thermal collector": "device for collecting heat from the sun",
    "sombrero": "wide-brimmed Mexican hat",
    "soup bowl": "bowl used for serving soup",
    "keyboard space bar": "long key on a keyboard for inserting spaces",
    "space heater": "device used to heat a small area",
    "space shuttle": "vehicle used for traveling to space",
    "spatula": "flat tool used for flipping or spreading food",
    "motorboat": "small boat powered by an engine",
    "spider web": "silk structure created by spiders",
    "spindle": "rod used for spinning thread",
    "sports car": "high-performance car designed for speed",
    "spotlight": "focused light used to illuminate a stage or subject",
    "stage": "platform used for performances",
    "steam locomotive": "train engine powered by steam",
    "through arch bridge": "bridge supported by arches that span the gap",
    "steel drum": "musical instrument made from a steel barrel",
    "stethoscope": "medical instrument used for listening to heart and lungs",
    "scarf": "garment worn around the neck for warmth or style",
    "stone wall": "wall made of stones",
    "stopwatch": "device used to measure elapsed time",
    "stove": "appliance used for cooking or heating",
    "strainer": "tool used for separating liquids from solids",
    "tram": "public transportation vehicle that runs on tracks",
    "stretcher": "portable bed used to carry patients",
    "couch": "piece of furniture for seating multiple people",
    "stupa": "dome-shaped Buddhist shrine",
    "submarine": "underwater vessel",
    "suit": "formal matching jacket and trousers",
    "sundial": "device for telling time using the sun's shadow",
    "sunglasses": "eyewear for protecting the eyes from sunlight",
    "sunscreen": "lotion used to protect skin from the sun",
    "suspension bridge": "bridge supported by cables hanging from towers",
    "mop": "tool for cleaning floors",
    "sweatshirt": "long-sleeved garment for casual wear or exercise",
    "swim trunks / shorts": "shorts worn for swimming",
    "swing": "seat suspended by ropes or chains for swinging back and forth",
    "electrical switch": "device used to turn electricity on or off",
    "syringe": "instrument used for injecting or withdrawing fluids",
    "table lamp": "small lamp placed on a table for light",
    "tank": "armored military vehicle with a large gun",
    "tape player": "device for playing cassette tapes",
    "teapot": "container used for brewing and serving tea",
    "teddy bear": "soft toy in the shape of a bear",
    "television": "device for watching broadcast programs",
    "tennis ball": "small rubber ball used in tennis",
    "thatched roof": "roof made from straw or reeds",
    "front curtain": "main curtain on a stage",
    "thimble": "small protective cap worn on the finger while sewing",
    "threshing machine": "device for separating grain from plants",
    "throne": "ceremonial chair for royalty",
    "tile roof": "roof covered with ceramic or clay tiles",
    "toaster": "appliance for browning bread",
    "tobacco shop": "store selling tobacco products",
    "toilet seat": "hinged seat for a toilet",
    "torch": "portable device for producing light, often with fire",
    "totem pole": "carved wooden pole representing figures or stories",
    "tow truck": "vehicle used for towing disabled cars",
    "toy store": "shop selling toys",
    "tractor": "vehicle used in farming to pull machinery",
    "semi-trailer truck": "large truck used for transporting goods",
    "tray": "flat surface used to carry items",
    "trench coat": "long, weatherproof coat",
    "tricycle": "three-wheeled vehicle for children",
    "trimaran": "sailing boat with three hulls",
    "tripod": "three-legged stand for supporting a camera or other equipment",
    "triumphal arch": "monumental arch built to commemorate victories",
    "trolleybus": "electric bus powered by overhead wires",
    "trombone": "brass instrument with a sliding mechanism",
    "hot tub": "heated pool for relaxation",
    "turnstile": "gate that allows one person through at a time",
    "typewriter keyboard": "keys used for typing on a typewriter",
    "umbrella": "device used for protection from rain",
    "unicycle": "one-wheeled bicycle",
    "upright piano": "vertical piano with strings positioned vertically",
    "vacuum cleaner": "device used for cleaning floors by suction",
    "vase": "container used for holding flowers",
    "vaulted or arched ceiling": "ceiling with a curved or arched structure",
    "velvet fabric": "soft, luxurious fabric with a smooth surface",
    "vending machine": "machine that dispenses items when money is inserted",
    "vestment": "garment worn by clergy during religious ceremonies",
    "viaduct": "bridge for carrying a road or railroad over a valley",
    "violin": "stringed instrument played with a bow",
    "volleyball": "ball used in the sport of volleyball",
    "waffle iron": "appliance for cooking waffles",
    "wall clock": "clock mounted on a wall",
    "wallet": "small case for holding money and cards",
    "wardrobe": "large cabinet for storing clothes",
    "military aircraft": "aircraft used by the military for combat or transport",
    "sink": "basin with taps for washing hands or dishes",
    "washing machine": "A machine that washes clothes.",
    "water bottle": "A container for holding water.",
    "water jug": "A large container for holding water.",
    "water tower": "A tall structure holding water for supply.",
    "whiskey jug": "A jug used to store whiskey.",
    "whistle": "A small instrument that makes a high-pitched sound.",
    "hair wig": "Artificial hair worn on the head.",
    "window screen": "A mesh screen used to cover windows.",
    "window shade": "A covering for windows to block light.",
    "Windsor tie": "A type of necktie knot.",
    "wine bottle": "A bottle for holding wine.",
    "airplane wing": "The part of a plane that provides lift.",
    "wok": "A round-bottomed cooking pan.",
    "wooden spoon": "A spoon made of wood for cooking or eating.",
    "wool": "A textile fiber from sheep.",
    "split-rail fence": "A fence made from split wood logs.",
    "shipwreck": "The remains of a wrecked ship.",
    "sailboat": "A boat propelled by sails.",
    "yurt": "A circular tent used by nomads.",
    "website": "A collection of online pages.",
    "comic book": "A book with comic strips or stories.",
    "crossword": "A word puzzle in a grid format.",
    "traffic or street sign": "A sign providing road information.",
    "traffic light": "A signal for controlling vehicle traffic.",
    "dust jacket": "A removable cover for a book.",
    "menu": "A list of food items available in a restaurant.",
    "plate": "A flat dish for serving food.",
    "guacamole": "A dip made from mashed avocado.",
    "consomme": "A clear soup or broth.",
    "hot pot": "A Chinese dish cooked at the table in a simmering pot.",
    "trifle": "A layered dessert with cake and cream.",
    "ice cream": "A frozen dessert made from cream.",
    "popsicle": "A frozen treat on a stick.",
    "baguette": "A long, thin loaf of French bread.",
    "bagel": "A round bread roll with a hole in the middle.",
    "pretzel": "A twisted, baked bread snack.",
    "cheeseburger": "A hamburger with cheese.",
    "hot dog": "A sausage in a bun.",
    "mashed potatoes": "Potatoes mashed and mixed with butter or milk.",
    "cabbage": "A leafy vegetable, often green or purple.",
    "broccoli": "A green vegetable with a tree-like shape.",
    "cauliflower": "A white vegetable, similar to broccoli.",
    "zucchini": "A green summer squash.",
    "spaghetti squash": "A squash with stringy, spaghetti-like flesh.",
    "acorn squash": "A small winter squash shaped like an acorn.",
    "butternut squash": "A large, sweet squash with a smooth rind.",
    "cucumber": "A long, green vegetable often used in salads.",
    "artichoke": "A large, green vegetable with a tough outer layer.",
    "bell pepper": "A sweet, crunchy pepper available in different colors.",
    "cardoon": "A thistle-like plant with edible stalks.",
    "mushroom": "A fungus with a stalk and cap.",
    "Granny Smith apple": "A tart, green apple variety.",
    "strawberry": "A small, red, sweet fruit with seeds on the outside.",
    "orange": "A round, citrus fruit with orange skin.",
    "lemon": "A yellow, sour citrus fruit.",
    "fig": "A sweet fruit with soft flesh and many seeds.",
    "pineapple": "A tropical fruit with spiky skin and sweet flesh.",
    "banana": "A long, curved fruit with soft, sweet flesh.",
    "jackfruit": "A large tropical fruit with spiky skin.",
    "cherimoya (custard apple)": "A sweet, creamy tropical fruit.",
    "pomegranate": "A fruit with a tough rind and juicy seeds inside.",
    "hay": "Dried grass used for feeding animals.",
    "carbonara": "A pasta dish with eggs, cheese, and bacon.",
    "chocolate syrup": "A sweet liquid made from chocolate.",
    "dough": "A mixture of flour and liquid for baking.",
    "meatloaf": "A baked dish of ground meat.",
    "pizza": "A dish of dough topped with sauce, cheese, and toppings.",
    "pot pie": "A pie with a savory filling, often meat and vegetables.",
    "burrito": "A tortilla wrapped around a filling.",
    "red wine": "An alcoholic beverage made from red grapes.",
    "espresso": "A strong, concentrated coffee.",
    "tea cup": "A small cup for drinking tea.",
    "eggnog": "A sweet, creamy drink with eggs and milk.",
    "mountain": "A large, steep landform.",
    "bubble": "A small ball of air in liquid.",
    "cliff": "A steep rock face.",
    "coral reef": "An underwater structure made of coral.",
    "geyser": "A hot spring that periodically erupts water.",
    "lakeshore": "The land along the edge of a lake.",
    "promontory": "A high point of land jutting into water.",
    "sandbar": "A ridge of sand built up by water currents.",
    "beach": "A sandy or pebbly shore beside a body of water.",
    "valley": "A low area between hills or mountains.",
    "volcano": "A mountain that erupts with lava.",
    "baseball player": "A person who plays baseball.",
    "bridegroom": "A man who is getting married.",
    "scuba diver": "A person who dives underwater with breathing equipment.",
    "rapeseed": "A bright yellow flowering plant used for oil.",
    "daisy": "A common flower with white petals and a yellow center.",
    "yellow lady's slipper": "A wild orchid with a yellow, slipper-shaped bloom.",
    "corn": "A cereal plant with kernels used as food.",
    "acorn": "A nut from an oak tree.",
    "rose hip": "The fruit of a rose plant.",
    "horse chestnut seed": "A seed from a horse chestnut tree.",
    "coral fungus": "A fungus that looks like coral.",
    "agaric": "A type of mushroom with gills under the cap.",
    "gyromitra": "A mushroom with a brain-like appearance.",
    "stinkhorn mushroom": "A foul-smelling mushroom.",
    "earth star fungus": "A star-shaped fungus that opens to release spores.",
    "hen of the woods mushroom": "A large, clustered mushroom.",
    "bolete": "A mushroom with a thick stem and sponge-like cap.",
    "corn cob": "The central core of an ear of corn.",
    "toilet paper": "Paper used for cleaning after using the toilet."
}