{
    "tench": "A simple line drawing of a fish with a long body.",
    "goldfish": "A sketch of a small, ornamental fish with flowing fins.",
    "great white shark": "A sketch of a large predatory shark with a pointed snout.",
    "tiger shark": "A sketch of a shark with tiger-like stripes.",
    "hammerhead shark": "A sketch of a shark with a T-shaped head.",
    "electric ray": "A sketch of a ray with the ability to generate electric shocks.",
    "stingray": "A sketch of a flat, disc-shaped fish with a long tail.",
    "rooster": "A simple line drawing of a male chicken with a prominent comb.",
    "hen": "A sketch of a female chicken with a round body.",
    "ostrich": "A sketch of a large, flightless bird with long legs.",
    "brambling": "A simple line drawing of a small songbird.",
    "goldfinch": "A sketch of a small bird with yellow feathers and a black cap.",
    "house finch": "A simple line drawing of a bird with a red breast.",
    "junco": "A sketch of a small, dark-colored sparrow.",
    "indigo bunting": "A sketch of a small, blue bird with a short beak.",
    "American robin": "A simple line drawing of a bird with a red breast.",
    "bulbul": "A sketch of a small songbird with a rounded body.",
    "jay": "A sketch of a colorful, noisy bird with a crest.",
    "magpie": "A simple line drawing of a black-and-white bird with a long tail.",
    "chickadee": "A sketch of a small bird with a black cap and a cheerful expression.",
    "American dipper": "A sketch of a small bird dipping near a stream.",
    "kite (bird of prey)": "A simple line drawing of a bird of prey with a forked tail.",
    "bald eagle": "A sketch of a large bird of prey with a white head and yellow beak.",
    "vulture": "A simple line drawing of a large scavenger bird.",
    "great grey owl": "A sketch of a large, round-faced owl.",
    "fire salamander": "A simple drawing of a black salamander with yellow spots.",
    "smooth newt": "A sketch of a small amphibian with a long tail.",
    "newt": "A simple line drawing of a small, aquatic salamander.",
    "spotted salamander": "A sketch of a salamander with spots on its body.",
    "axolotl": "A simple drawing of a salamander with external gills.",
    "American bullfrog": "A sketch of a large green frog.",
    "tree frog": "A simple line drawing of a small frog with sticky feet.",
    "tailed frog": "A sketch of a frog with a tail-like appendage.",
    "loggerhead sea turtle": "A simple drawing of a large sea turtle with a thick head.",
    "leatherback sea turtle": "A sketch of a large turtle with a leathery shell.",
    "mud turtle": "A simple line drawing of a small turtle found in muddy waters.",
    "terrapin": "A sketch of a small freshwater turtle with a hard shell.",
    "box turtle": "A drawing of a land turtle that can close its shell.",
    "banded gecko": "A simple sketch of a small gecko with stripes.",
    "green iguana": "A drawing of a large, green lizard.",
    "Carolina anole": "A sketch of a small lizard capable of changing color.",
    "desert grassland whiptail lizard": "A simple line drawing of a slender lizard.",
    "agama": "A sketch of a colorful lizard found in Africa and Asia.",
    "frilled-necked lizard": "A drawing of a lizard with a frilled neck.",
    "alligator lizard": "A simple sketch of a lizard resembling an alligator.",
    "Gila monster": "A sketch of a large lizard with black and orange skin.",
    "European green lizard": "A simple drawing of a bright green lizard.",
    "chameleon": "A sketch of a lizard that can change its color.",
    "Komodo dragon": "A line drawing of a large lizard native to Indonesia.",
    "Nile crocodile": "A simple sketch of a large reptile found in the Nile.",
    "American alligator": "A drawing of a large reptile native to the U.S.",
    "triceratops": "A sketch of a large, three-horned dinosaur.",
    "worm snake": "A simple line drawing of a small, burrowing snake.",
    "ring-necked snake": "A sketch of a snake with a red or orange ring around its neck.",
    "eastern hog-nosed snake": "A simple drawing of a snake with an upturned nose.",
    "smooth green snake": "A line drawing of a small, green snake.",
    "kingsnake": "A simple sketch of a colorful, non-venomous snake.",
    "garter snake": "A drawing of a thin, non-venomous snake.",
    "water snake": "A simple line drawing of a snake that lives in water.",
    "vine snake": "A sketch of a slender snake resembling a vine.",
    "night snake": "A simple line drawing of a small, nocturnal snake.",
    "boa constrictor": "A sketch of a large snake that kills by constriction.",
    "African rock python": "A line drawing of a large, non-venomous snake.",
    "Indian cobra": "A sketch of a venomous snake with a hood.",
    "green mamba": "A simple drawing of a venomous snake found in Africa.",
    "sea snake": "A sketch of a snake that lives in the sea.",
    "Saharan horned viper": "A simple line drawing of a venomous snake with horns.",
    "eastern diamondback rattlesnake": "A sketch of a venomous snake with a rattling tail.",
    "sidewinder rattlesnake": "A drawing of a snake that moves sideways.",
    "trilobite": "A simple sketch of an extinct, segmented arthropod.",
    "harvestman": "A simple line drawing of a small arachnid.",
    "scorpion": "A sketch of a predatory arachnid with pincers and a stinger.",
    "yellow garden spider": "A simple drawing of a spider with yellow patterns.",
    "barn spider": "A sketch of a spider often found in barns.",
    "European garden spider": "A line drawing of a spider with a distinctive web.",
    "southern black widow": "A simple sketch of a black widow spider.",
    "tarantula": "A drawing of a large, hairy spider.",
    "wolf spider": "A sketch of a fast-moving spider that hunts its prey.",
    "tick": "A simple line drawing of a small parasitic arachnid.",
    "centipede": "A drawing of a long arthropod with many legs.",
    "black grouse": "A simple sketch of a dark-colored bird.",
    "ptarmigan": "A drawing of a bird that changes color with the seasons.",
    "ruffed grouse": "A sketch of a bird with feathers around its neck.",
    "prairie grouse": "A simple line drawing of a bird found in grasslands.",
    "peafowl": "A sketch of a bird with a colorful, large tail.",
    "quail": "A simple line drawing of a small, round bird.",
    "partridge": "A sketch of a medium-sized bird found in fields.",
    "african grey parrot": "A drawing of a grey parrot known for its intelligence.",
    "macaw": "A simple line drawing of a brightly colored parrot.",
    "sulphur-crested cockatoo": "A sketch of a white parrot with a yellow crest.",
    "lorikeet": "A drawing of a small, colorful parrot.",
    "coucal": "A simple line drawing of a ground-dwelling bird.",
    "bee eater": "A sketch of a bird that feeds on bees and insects.",
    "hornbill": "A simple line drawing of a bird with a large, curved beak.",
    "hummingbird": "A drawing of a small bird capable of hovering.",
    "jacamar": "A sketch of a tropical bird with vibrant plumage.",
    "toucan": "A simple line drawing of a bird with a large, colorful bill.",
    "duck": "A small waterfowl with webbed feet and a broad bill.",
    "red-breasted merganser": "A duck with a red chest and long, slender neck.",
    "goose": "A large waterfowl with a long neck and typically gray or white feathers.",
    "black swan": "A large bird with black feathers and a long, curved neck.",
    "tusker": "A large elephant with prominent tusks.",
    "echidna": "A spiny mammal with a long snout, resembling a hedgehog.",
    "platypus": "A small mammal with a duck-like bill and webbed feet.",
    "wallaby": "A small kangaroo-like marsupial with short legs.",
    "koala": "A bear-like marsupial with gray fur and large ears.",
    "wombat": "A short, stocky marsupial with a large, round body.",
    "jellyfish": "A transparent, bell-shaped sea creature with tentacles.",
    "sea anemone": "A soft, colorful sea creature with tentacles around its mouth.",
    "brain coral": "A coral with a surface resembling the folds of a brain.",
    "flatworm": "A soft, flat-bodied invertebrate with no legs.",
    "nematode": "A round, unsegmented worm-like creature.",
    "conch": "A marine mollusk with a spiral-shaped shell.",
    "snail": "A small mollusk with a coiled shell and a slimy body.",
    "slug": "A snail without a shell, with a soft, moist body.",
    "sea slug": "A marine gastropod with colorful and varied appearances.",
    "chiton": "A mollusk with a shell made of overlapping plates.",
    "chambered nautilus": "A mollusk with a spiral-shaped shell that can retract.",
    "Dungeness crab": "A crab with a round, reddish-brown shell.",
    "rock crab": "A small, hard-shelled crab found on rocky shores.",
    "fiddler crab": "A small crab with one much larger claw.",
    "red king crab": "A large crab with red shell and long legs.",
    "American lobster": "A large lobster with large claws and a hard shell.",
    "spiny lobster": "A lobster with spiny legs and a long body.",
    "crayfish": "A small freshwater crustacean resembling a mini-lobster.",
    "hermit crab": "A crab that occupies empty shells for protection.",
    "isopod": "A small crustacean with a segmented body and multiple legs.",
    "white stork": "A tall bird with white feathers and long, thin legs.",
    "black stork": "A stork with black feathers and a long, sharp beak.",
    "spoonbill": "A bird with a long, flat bill that looks like a spoon.",
    "flamingo": "A tall bird with pink feathers and long, thin legs.",
    "little blue heron": "A small heron with blue-gray feathers.",
    "great egret": "A large, elegant bird with all-white feathers.",
    "bittern bird": "A large, secretive bird with brown plumage.",
    "crane bird": "A tall bird known for its graceful posture and long neck.",
    "limpkin": "A long-legged wader bird with a curved bill.",
    "common gallinule": "A bird with a red bill and a white ring around the neck.",
    "American coot": "A small water bird with a dark body and white beak.",
    "bustard": "A large, heavy bird with a long neck, found in open fields.",
    "ruddy turnstone": "A small shorebird known for turning over stones while searching for food.",
    "dunlin": "A small shorebird with a slightly upturned bill.",
    "common redshank": "A shorebird with reddish legs and a long bill.",
    "dowitcher": "A long-billed shorebird found along coasts.",
    "oystercatcher": "A large shorebird with a long, orange beak.",
    "pelican": "A large bird with a long beak and a pouch beneath it.",
    "king penguin": "A large, upright penguin with a bright orange patch on its head.",
    "albatross": "A large seabird with long, pointed wings.",
    "grey whale": "A large whale with a greyish body, often with barnacles on its skin.",
    "killer whale": "A large predator whale with black and white markings.",
    "dugong": "A sea mammal similar to a manatee, with a large, paddle-shaped tail.",
    "sea lion": "A marine mammal with external ear flaps and a playful nature.",
    "Chihuahua": "A tiny, energetic dog breed with a distinctive large head.",
    "Japanese Chin": "A small, elegant dog with a silky coat and a tail that curls over its back.",
    "Maltese": "A small dog with a long, white, silky coat.",
    "Pekingese": "A small dog with a flat face and a long, flowing coat.",
    "Shih Tzu": "A small dog with a long, straight coat and a pushed-in face.",
    "King Charles Spaniel": "A small, affectionate dog with large, expressive eyes.",
    "Papillon": "A small dog with large, butterfly-like ears.",
    "toy terrier": "A small, energetic terrier breed.",
    "Rhodesian Ridgeback": "A large dog with a distinctive ridge of hair along its back.",
    "Afghan Hound": "A tall dog with long, flowing fur and a dignified appearance.",
    "Basset Hound": "A short dog with long ears and a droopy face.",
    "Beagle": "A small hound dog known for its keen sense of smell.",
    "Bloodhound": "A large hound dog known for its excellent tracking ability.",
    "Bluetick Coonhound": "A medium-sized hound dog with blue mottled fur.",
    "Black and Tan Coonhound": "A hound with black fur and tan markings on its legs and face.",
    "Treeing Walker Coonhound": "A medium-sized hound with a striking coat and a treeing ability.",
    "English foxhound": "A tall hound with a long body and short coat.",
    "Redbone Coonhound": "A medium-sized hound with a reddish-brown coat.",
    "borzoi": "A tall, slender dog with a long, silky coat.",
    "Irish Wolfhound": "A very large, rough-coated dog originally bred for hunting.",
    "Italian Greyhound": "A small, slender dog with a short coat.",
    "Whippet": "A small greyhound-like dog known for its speed.",
    "Ibizan Hound": "A tall, lean dog with large ears and a graceful build.",
    "Norwegian Elkhound": "A medium-sized hound dog with a thick, double coat.",
    "Otterhound": "A large hound with a rough, water-resistant coat.",
    "Saluki": "A slender dog with long legs, originally bred for hunting.",
    "Scottish Deerhound": "A tall, shaggy dog bred for hunting deer.",
    "Weimaraner": "A medium-to-large dog with a distinctive grey coat.",
    "Staffordshire Bull Terrier": "A medium-sized terrier with a muscular build.",
    "American Staffordshire Terrier": "A strong, muscular dog with a confident demeanor.",
    "Bedlington Terrier": "A small terrier with a unique, lamb-like appearance.",
    "Border Terrier": "A small, wiry-coated terrier.",
    "Kerry Blue Terrier": "A medium-sized terrier with a curly, blue-gray coat.",
    "Irish Terrier": "A medium-sized terrier with a wiry coat.",
    "Norfolk Terrier": "A small, scruffy terrier with a friendly demeanor.",
    "Norwich Terrier": "A small, energetic terrier with a wiry coat.",
    "Yorkshire Terrier": "A tiny dog with a silky coat and a spunky personality.",
    "Wire Fox Terrier": "A small, energetic terrier with a wiry coat.",
    "Lakeland Terrier": "A small, sturdy terrier with a rough coat.",
    "Sealyham Terrier": "A small terrier with a distinctive white coat.",
    "Airedale Terrier": "A large terrier with a long body and flat coat.",
    "Cairn Terrier": "A small, scruffy terrier with a bushy coat.",
    "Australian Terrier": "A small, scruffy dog with a pointed face.",
    "Dandie Dinmont Terrier": "A small dog with a long body and topknot of hair.",
    "Boston Terrier": "A small dog with a tuxedo-like black-and-white coat.",
    "Miniature Schnauzer": "A small dog with a wiry coat and distinct beard.",
    "Giant Schnauzer": "A large dog with a wiry coat and a strong build.",
    "Standard Schnauzer": "A medium-sized dog with a wiry coat and a square build.",
    "Scottish Terrier": "A small dog with a rough coat and a pointed nose.",
    "Tibetan Terrier": "A medium dog with a long coat and fluffy appearance.",
    "Australian Silky Terrier": "A small dog with a shiny, silky coat.",
    "Soft-coated Wheaten Terrier": "A small dog with a soft, flowing coat.",
    "West Highland White Terrier": "A small dog with a fluffy white coat.",
    "Lhasa Apso": "A small dog with a long, flowing coat.",
    "Flat-Coated Retriever": "A medium-large dog with a shiny, black coat.",
    "Curly-coated Retriever": "A dog with a curly, water-resistant coat.",
    "Golden Retriever": "A friendly dog with a golden, medium-length coat.",
    "Labrador Retriever": "A medium dog with a short, dense coat, friendly personality.",
    "Chesapeake Bay Retriever": "A strong dog with a thick coat, good for water work.",
    "German Shorthaired Pointer": "A medium dog with a short, spotted coat.",
    "Vizsla": "A medium dog with a short, rust-colored coat.",
    "English Setter": "A medium dog with a long, flowing coat, good for hunting.",
    "Irish Setter": "A large dog with a long, silky red coat.",
    "Gordon Setter": "A large dog with a glossy black-and-tan coat.",
    "Brittany dog": "A small-to-medium dog with a curly coat, good for hunting.",
    "Clumber Spaniel": "A medium dog with a heavy coat and droopy face.",
    "English Springer Spaniel": "A friendly dog with a wavy coat, often used for hunting.",
    "Welsh Springer Spaniel": "A dog with a curly coat, used for hunting.",
    "Cocker Spaniel": "A small dog with a long, silky coat and big ears.",
    "Sussex Spaniel": "A medium dog with a thick, wavy coat and drooping ears.",
    "Irish Water Spaniel": "A curly-coated dog, loves water and hunting.",
    "Kuvasz": "A large white dog, originally bred to guard livestock.",
    "Schipperke": "A small dog with a thick coat and fox-like appearance.",
    "Groenendael dog": "A medium-sized dog with a long, black coat, herding breed.",
    "Malinois": "A medium dog with a short coat, part of the Belgian shepherd family.",
    "Briard": "A large dog with a long, shaggy coat, known for guarding.",
    "Australian Kelpie": "A small-to-medium herding dog with a short coat.",
    "Komondor": "A large dog with a white, corded coat resembling dreadlocks.",
    "Old English Sheepdog": "A large dog with a thick, shaggy coat and a sweet face.",
    "Shetland Sheepdog": "A small dog with a rough coat, similar to a collie.",
    "collie": "A medium dog with a long, flowing coat, known for herding.",
    "Border Collie": "A highly intelligent herding dog with a medium-length coat.",
    "Bouvier des Flandres dog": "A large dog with a thick coat and working instincts.",
    "Rottweiler": "A strong dog with a black-and-tan coat, often used for guarding.",
    "German Shepherd Dog": "A large, intelligent dog with a thick, tan-and-black coat.",
    "Dobermann": "A muscular dog with a sleek black-and-tan coat.",
    "Miniature Pinscher": "A small, sleek dog with a compact body.",
    "Greater Swiss Mountain Dog": "A large dog with a tri-color coat, used for herding.",
    "Bernese Mountain Dog": "A large dog with a tri-color coat, friendly temperament.",
    "Appenzeller Sennenhund": "A medium-sized dog with a tri-color coat, Swiss breed.",
    "Entlebucher Sennenhund": "A small-to-medium herding dog with a tri-color coat.",
    "Boxer": "A strong, medium dog with a short coat and muscular build.",
    "Bullmastiff": "A large, muscular dog with a short coat, used for guarding.",
    "Tibetan Mastiff": "A giant dog with a thick, long coat, bred for guarding.",
    "French Bulldog": "A small, muscular dog with large ears and a compact body.",
    "Great Dane": "A giant dog with a short coat, friendly and gentle.",
    "St. Bernard": "A giant dog with a thick coat, originally bred for rescue work.",
    "husky": "A medium dog with a thick coat, used for sledding in cold regions.",
    "Alaskan Malamute": "A large, strong dog with a thick coat, bred for heavy sledding.",
    "Siberian Husky": "A medium dog with a thick coat and high energy, used for sledding.",
    "Dalmatian": "A small-to-medium dog with a distinctive black or liver-colored coat.",
    "Affenpinscher": "A small dog with a wiry coat and a monkey-like face.",
    "Basenji": "A small dog known for not barking, with a sleek coat.",
    "pug": "A small dog with a wrinkled face and curled tail.",
    "Leonberger": "A large, fluffy dog with a golden coat and friendly nature.",
    "Newfoundland dog": "A giant dog with a thick coat, known for its swimming ability.",
    "Great Pyrenees dog": "A large, white dog with a long, fluffy coat.",
    "Samoyed": "A medium dog with a thick, white coat and a happy smile.",
    "Pomeranian": "A small dog with a fluffy coat and a fox-like face.",
    "Chow Chow": "A medium dog with a thick, lion-like mane and a blue-black tongue.",
    "Keeshond": "A medium dog with a fluffy, silver-gray coat and fox-like face.",
    "brussels griffon": "A small dog with a distinctive short snout and long whiskers.",
    "Pembroke Welsh Corgi": "A small dog with short legs and a thick, fluffy coat.",
    "Cardigan Welsh Corgi": "A small dog with short legs and a long, bushy tail.",
    "Toy Poodle": "A small dog with curly, hypoallergenic hair.",
    "Miniature Poodle": "A medium dog with a curly coat, known for its intelligence.",
    "Standard Poodle": "A large dog with a curly, hypoallergenic coat.",
    "Mexican hairless dog (xoloitzcuintli)": "A small dog with smooth skin and no coat.",
    "grey wolf": "A large wild animal with grey fur and a bushy tail.",
    "Alaskan tundra wolf": "A large wolf found in cold, arctic regions.",
    "red wolf or maned wolf": "A medium-sized wolf with reddish fur and a mane.",
    "coyote": "A wild dog with a slender build and bushy tail.",
    "dingo": "A wild dog native to Australia, lean and agile.",
    "dhole": "A wild dog known for its pack behavior and unique vocalizations.",
    "African wild dog": "A wild dog with a unique patchy coat and strong pack instincts.",
    "hyena": "A wild carnivore known for its laugh-like call and strong jaws.",
    "red fox": "A small, red-furred fox with a bushy tail.",
    "kit fox": "A small, slender fox with large ears and light-colored fur.",
    "Arctic fox": "A small fox with white fur, adapted to cold climates.",
    "grey fox": "A small fox with a gray coat and a bushy tail.",
    "tabby cat": "A domestic cat with a striped coat.",
    "tiger cat": "A domestic cat with stripes similar to a tiger.",
    "Persian cat": "A long-haired cat with a round face.",
    "Siamese cat": "A slender cat with blue almond-shaped eyes and short coat.",
    "Egyptian Mau": "A domestic cat with a spotted coat and green eyes.",
    "cougar": "A large wild cat with a tan, sleek body.",
    "lynx": "A wild cat with tufted ears and short tail.",
    "leopard": "A large cat with a spotted coat.",
    "snow leopard": "A wild cat with a thick, spotted fur, native to cold mountains.",
    "jaguar": "A large wild cat with a golden coat and black rosettes.",
    "lion": "A large cat with a mane, known as the 'king of the jungle'.",
    "tiger": "A large striped wild cat with orange and black fur.",
    "cheetah": "A fast wild cat with a slender body and black spots.",
    "brown bear": "A large bear with brown fur, found in forests and mountains.",
    "American black bear": "A medium-sized bear with black fur, common in North America.",
    "polar bear": "A large white bear adapted to cold, Arctic climates.",
    "sloth bear": "A bear with shaggy black fur and a white snout, native to India.",
    "mongoose": "A small mammal known for hunting snakes.",
    "meerkat": "A small, social mammal with a pointed face and upright posture.",
    "tiger beetle": "A fast-moving beetle with metallic-colored wings.",
    "ladybug": "A small red beetle with black spots, often seen on plants.",
    "ground beetle": "A large beetle found on the ground, often black.",
    "longhorn beetle": "A beetle with long antennae and a long body.",
    "leaf beetle": "A beetle that feeds on leaves, usually green or brown.",
    "dung beetle": "A beetle that rolls dung into balls for food.",
    "rhinoceros beetle": "A large beetle with a horn on its head, resembling a rhino.",
    "weevil": "A small beetle with an elongated snout.",
    "fly": "A small insect with wings that can fly rapidly.",
    "bee": "A flying insect known for pollination and honey production.",
    "ant": "A small insect that lives in colonies and works together.",
    "grasshopper": "A green insect that jumps and makes chirping sounds.",
    "cricket insect": "A small insect known for its loud, rhythmic chirping.",
    "stick insect": "An insect that looks like a twig or stick for camouflage.",
    "cockroach": "A flat, brown insect known for its fast movements.",
    "praying mantis": "An insect with long legs, known for its praying posture.",
    "cicada": "An insect with a loud, buzzing sound, often in summer.",
    "leafhopper": "A small insect that jumps and feeds on plant sap.",
    "lacewing": "A green insect with delicate wings, known for its predation of aphids.",
    "dragonfly": "A large insect with long wings and a slender body.",
    "damselfly": "A small, delicate insect similar to a dragonfly, but with thinner wings.",
    "red admiral butterfly": "A butterfly with red and black wings.",
    "ringlet butterfly": "A butterfly with brown wings and eye-like markings.",
    "monarch butterfly": "A butterfly with orange and black wings, known for migration.",
    "small white butterfly": "A small white butterfly with light patterns on its wings.",
    "sulphur butterfly": "A yellow butterfly often seen in warm climates.",
    "gossamer-winged butterfly": "A butterfly with transparent wings and delicate appearance.",
    "starfish": "A marine animal with five arms and a spiny surface.",
    "sea urchin": "A spiny sea creature with a spherical shape.",
    "sea cucumber": "A soft, elongated sea creature found on the ocean floor.",
    "cottontail rabbit": "A small rabbit with a fluffy white tail.",
    "hare": "A fast rabbit-like animal with long ears and legs.",
    "Angora rabbit": "A long-haired rabbit known for its soft, fluffy coat.",
    "hamster": "A small, furry rodent kept as a pet, often in cages.",
    "porcupine": "A large rodent with sharp quills covering its body.",
    "fox squirrel": "A large squirrel with a reddish-brown body and bushy tail.",
    "marmot": "A large ground squirrel, often seen in mountainous regions.",
    "beaver": "A large, semi-aquatic mammal with a flat tail and sharp teeth.",
    "guinea pig": "A small, round rodent often kept as a pet.",
    "common sorrel horse": "A horse with a reddish-brown coat.",
    "zebra": "A horse-like animal with black and white stripes.",
    "pig": "A domesticated animal with a snout, often raised for meat.",
    "wild boar": "A wild, tusked pig found in forests and jungles.",
    "warthog": "A wild pig with large tusks and facial warts.",
    "hippopotamus": "A large, semi-aquatic mammal with a broad mouth.",
    "ox": "A domesticated large animal used for pulling carts.",
    "water buffalo": "A large, domesticated animal often used for plowing.",
    "bison": "A large, shaggy mammal native to North America.",
    "ram (adult male sheep)": "A male sheep with large, curled horns.",
    "bighorn sheep": "A mountain sheep with large, curved horns.",
    "Alpine ibex": "A wild goat with curved horns, native to mountainous regions.",
    "hartebeest": "A large antelope with a long face and distinctive horns.",
    "impala (antelope)": "A medium-sized antelope with curved, sharp horns.",
    "gazelle": "A small antelope known for its grace and speed.",
    "arabian camel": "A camel with one hump, native to the Arabian Peninsula.",
    "llama": "A domesticated camelid with long hair and used as a pack animal.",
    "weasel": "A small, slender carnivore with a long body and sharp teeth.",
    "mink": "A small, carnivorous mammal known for its fur.",
    "European polecat": "A small, ferret-like carnivore with a dark coat.",
    "black-footed ferret": "A small, endangered carnivore with black feet and a dark tail.",
    "otter": "A playful aquatic mammal with a long body and webbed feet.",
    "skunk": "A small mammal known for its strong-smelling spray.",
    "badger": "A burrowing carnivore with gray fur and a stocky body.",
    "armadillo": "A small mammal with a tough, armor-like shell.",
    "three-toed sloth": "A slow-moving mammal with three toes on each foot.",
    "orangutan": "A large, orange-haired ape native to Southeast Asia.",
    "gorilla": "A large, muscular ape with black fur, native to Africa.",
    "chimpanzee": "A great ape closely related to humans, known for its intelligence.",
    "gibbon": "A small ape with long arms and a loud call.",
    "siamang": "A large, black gibbon with a throat sac for loud calls.",
    "guenon": "A type of monkey with a brightly colored face.",
    "patas monkey": "A monkey with a red-brown coat and long legs.",
    "baboon": "A large monkey with a dog-like face and large, sharp teeth.",
    "macaque": "A type of monkey with a short tail and often found in groups.",
    "langur": "A long-tailed monkey native to Asia, often with a gray coat.",
    "black-and-white colobus": "A monkey with black fur and white facial hair.",
    "proboscis monkey": "A monkey with a large nose and a long tail.",
    "marmoset": "A small, monkey-like mammal with a long tail.",
    "white-headed capuchin": "A monkey with a white head and brown body.",
    "howler monkey": "A large monkey with a loud, howling call.",
    "titi monkey": "A small, long-tailed monkey found in South America.",
    "Geoffroy's spider monkey": "A large monkey with long limbs and a prehensile tail.",
    "common squirrel monkey": "A small monkey with a yellowish-brown body.",
    "ring-tailed lemur": "A lemur with a long, striped tail.",
    "indri": "A large lemur with a black and white coat, native to Madagascar.",
    "Asian elephant": "A smaller elephant with smaller ears and a rounded back.",
    "African bush elephant": "A large elephant with large ears and a wrinkled trunk.",
    "red panda": "A small, reddish-brown mammal with a long, bushy tail.",
    "giant panda": "A large black-and-white bear known for eating bamboo.",
    "snoek fish": "A long fish found in the ocean, often associated with South Africa.",
    "eel": "A long, slippery fish that looks like a snake.",
    "silver salmon": "A fish with shiny silver skin, found in cold waters.",
    "rock beauty fish": "A brightly colored fish often found in coral reefs.",
    "clownfish": "A small, orange fish with white stripes, commonly seen in anemones.",
    "sturgeon": "A large fish with spiny scales and a long snout.",
    "gar fish": "A fish with a long body and sharp teeth, often found in freshwater.",
    "lionfish": "A venomous fish with long, flowing fins and spiny rays.",
    "pufferfish": "A fish that inflates its body into a ball when threatened.",
    "abacus": "A wooden tool with beads used for counting and math.",
    "abaya": "A loose-fitting black robe worn by women, typically in the Middle East.",
    "academic gown": "A traditional robe worn by students and professors during ceremonies.",
    "accordion": "A musical instrument with a bellows, played by squeezing and pressing keys.",
    "acoustic guitar": "A guitar with a hollow body that produces sound without amplification.",
    "aircraft carrier": "A large ship that carries and launches military airplanes.",
    "airliner": "A large airplane used for commercial travel.",
    "airship": "A large, gas-filled balloon with a rigid structure, used for travel or observation.",
    "altar": "A raised platform or table used for religious ceremonies.",
    "ambulance": "A vehicle used for transporting sick or injured people to hospitals.",
    "amphibious vehicle": "A vehicle that can travel on land and in water.",
    "analog clock": "A clock with hands that move around a circular dial to show time.",
    "apiary": "A place where bees are kept, often called a bee yard.",
    "apron": "A piece of cloth worn over clothing to protect from dirt or stains.",
    "trash can": "A container for holding waste or garbage.",
    "assault rifle": "A military firearm designed for rapid fire and used in combat.",
    "backpack": "A bag worn on the back, often used for carrying items like books or gear.",
    "bakery": "A place where bread, cakes, and pastries are made and sold.",
    "balance beam": "A long, narrow beam used in gymnastics.",
    "balloon": "A flexible, inflatable object, often filled with air or helium.",
    "ballpoint pen": "A pen that uses a small ball to dispense ink as it is written.",
    "Band-Aid": "A small adhesive strip used to cover small cuts or wounds.",
    "banjo": "A stringed musical instrument with a round body and a long neck.",
    "baluster / handrail": "A vertical post supporting a railing, often seen on stairs or balconies.",
    "barbell": "A weightlifting equipment consisting of a long bar with weights at each end.",
    "barber chair": "A specialized chair used by barbers to cut hair.",
    "barbershop": "A place where men get their hair cut or styled.",
    "barn": "A large building used to store farm animals or crops.",
    "barometer": "An instrument used to measure air pressure and predict weather.",
    "barrel": "A large, cylindrical container used for storing liquids or goods.",
    "wheelbarrow": "A small cart with one wheel, used for carrying heavy loads.",
    "baseball": "A ball used in the sport of baseball, often stitched with red thread.",
    "basketball": "A ball used in the sport of basketball, usually orange with black lines.",
    "bassinet": "A small, portable crib for newborn babies.",
    "bassoon": "A large woodwind instrument with a deep, rich sound.",
    "swimming cap": "A tight-fitting cap worn to keep hair dry while swimming.",
    "bath towel": "A large towel used to dry off after a bath or shower.",
    "bathtub": "A large container for bathing, usually filled with water.",
    "station wagon": "A car with an extended body for carrying more passengers or cargo.",
    "lighthouse": "A tall structure with a light at the top, used to guide ships at sea.",
    "beaker": "A tall, cylindrical container used for measuring and mixing liquids.",
    "military hat (bearskin or shako)": "A tall, furred hat worn by soldiers in ceremonial uniforms.",
    "beer bottle": "A glass or plastic bottle used to contain beer.",
    "beer glass": "A glass designed for drinking beer, often with a wide rim.",
    "bell tower": "A tall tower that houses one or more bells, often found in churches.",
    "baby bib": "A piece of cloth worn by babies to protect clothing while eating.",
    "tandem bicycle": "A bicycle built for two riders, with two seats and two sets of pedals.",
    "bikini": "A two-piece swimsuit for women, usually consisting of a top and bottom.",
    "ring binder": "A folder with rings to hold punched paper together.",
    "binoculars": "A device with two lenses that allows you to see faraway objects clearly.",
    "birdhouse": "A small, man-made shelter for birds to nest in.",
    "boathouse": "A structure used for storing boats.",
    "bobsleigh": "A small, fast sled used for racing down icy tracks.",
    "bolo tie": "A type of necktie with a cord and decorative clasp, often worn in the American West.",
    "poke bonnet": "A style of bonnet with a wide brim that frames the face.",
    "bookcase": "A piece of furniture used to store books.",
    "bookstore": "A store that sells books.",
    "bottle cap": "A lid used to seal a bottle, often made of metal or plastic.",
    "hunting bow": "A curved weapon used to shoot arrows in hunting.",
    "bow tie": "A small, tied necktie often worn for formal occasions.",
    "brass memorial plaque": "A metal plaque used to honor someone, often mounted on a wall.",
    "bra": "A piece of clothing worn by women to support the breasts.",
    "breakwater": "A structure built to protect the shore from waves and erosion.",
    "breastplate": "A piece of armor worn to protect the chest.",
    "broom": "A cleaning tool with a long handle and bristles for sweeping.",
    "bucket": "A container with a handle, used for carrying liquids or materials.",
    "buckle": "A clasp used to fasten a belt or strap.",
    "bulletproof vest": "A protective garment worn to resist bullets and shrapnel.",
    "high-speed train": "A fast-moving train designed for long-distance travel.",
    "butcher shop": "A store where meat is sold.",
    "taxicab": "A car used for hire to transport passengers to various destinations.",
    "cauldron": "A large, round cooking pot, often used for boiling.",
    "candle": "A cylindrical block of wax with a wick, used for lighting.",
    "cannon": "A large, heavy gun used in warfare, often mounted on ships or fortifications.",
    "canoe": "A narrow boat that is paddled by hand.",
    "can opener": "A device used to open metal cans.",
    "cardigan": "A type of knitted sweater that opens at the front with buttons or a zipper.",
    "car mirror": "A reflective surface mounted in a vehicle to allow the driver to see behind.",
    "carousel": "A revolving ride with horses or other animals, often seen at amusement parks.",
    "tool kit": "A collection of tools used for various tasks or repairs.",
    "cardboard box / carton": "A large container made of cardboard used for packing or shipping.",
    "car wheel": "A round, rotating part of a vehicle that allows it to move.",
    "automated teller machine": "A machine that allows bank customers to withdraw money or perform other transactions.",
    "cassette": "A small, rectangular container used for storing magnetic tape.",
    "cassette player": "A device used to play cassette tapes.",
    "castle": "A large, fortified building or fortress, often associated with medieval times.",
    "catamaran": "A type of boat with two hulls side by side.",
    "CD player": "A device used to play compact discs.",
    "cello": "A large stringed instrument, similar to a violin but larger and played while seated.",
    "mobile phone": "A portable device for communication, often with a touchscreen.",
    "chain": "A series of connected metal links, used for fastening or support.",
    "chain-link fence": "A type of fence made from interwoven metal wires.",
    "chain mail": "A type of armor made of metal rings linked together.",
    "chainsaw": "A power tool with a rotating chain, used for cutting wood.",
    "storage chest": "A large container for storing items, often with a lid.",
    "chiffonier": "A tall dresser or chest of drawers, often with mirrors.",
    "bell or wind chime": "A device that produces sound when moved by wind.",
    "china cabinet": "A glass-fronted cabinet used for displaying fine china.",
    "Christmas stocking": "A decorated sock hung during Christmas for gifts.",
    "church": "A building used for Christian worship services.",
    "movie theater": "A place where movies are shown to an audience on a large screen.",
    "cleaver": "A large, heavy knife used for chopping meat.",
    "cliff dwelling": "A home built into the side of a cliff, often seen in ancient cultures.",
    "cloak": "A large, loose garment worn over other clothes for warmth or protection.",
    "clogs": "A type of footwear with a thick, wooden sole.",
    "cocktail shaker": "A container used for mixing ingredients for cocktails.",
    "coffee mug": "A cup used for drinking coffee, typically larger than a regular cup.",
    "coffeemaker": "A device used to brew coffee.",
    "spiral or coil": "A shape that curves around in a continuous loop, like a spring.",
    "combination lock": "A lock that is opened using a sequence of numbers or symbols.",
    "computer keyboard": "A device with keys used for typing on a computer.",
    "candy store": "A shop that sells sweets and candies.",
    "container ship": "A large ship used to carry shipping containers.",
    "convertible": "A car with a roof that can be folded back or removed.",
    "corkscrew": "A tool used to remove corks from bottles, typically wine.",
    "cornet": "A brass musical instrument similar to a trumpet.",
    "cowboy boot": "A tall, pointed boot traditionally worn by cowboys.",
    "cowboy hat": "A wide-brimmed hat typically worn by cowboys.",
    "cradle": "A small bed for babies, often rocking or swinging.",
    "construction crane": "A large machine used for lifting heavy materials on construction sites.",
    "crash helmet": "A protective helmet worn to prevent head injuries during accidents.",
    "crate": "A large, sturdy box used for transporting goods.",
    "infant bed": "A small bed designed for infants, often with safety rails.",
    "Crock Pot": "A slow-cooking electric appliance used to cook stews or soups.",
    "croquet ball": "A ball used in the game of croquet, typically colored and made of wood or plastic.",
    "crutch": "A supportive device used by people with leg injuries to help with walking.",
    "cuirass": "A piece of armor worn to protect the chest and back.",
    "dam": "A structure built to block or redirect the flow of water.",
    "desk": "A piece of furniture used for working, usually with drawers.",
    "desktop computer": "A personal computer designed to sit on a desk, usually with a monitor and keyboard.",
    "rotary dial telephone": "An older style of telephone with a circular rotary dial to make calls.",
    "diaper": "A piece of cloth or disposable material worn by infants to absorb waste.",
    "digital clock": "A clock that shows the time using numbers on a screen.",
    "digital watch": "A watch that shows the time digitally, rather than with hands.",
    "dining table": "A table used for eating meals, usually with chairs around it.",
    "dishcloth": "A cloth used for cleaning dishes and utensils.",
    "dishwasher": "An appliance used to clean dishes automatically.",
    "disc brake": "A braking system used in vehicles that uses a disc to stop rotation.",
    "dock": "A structure where boats and ships can be moored or unloaded.",
    "dog sled": "A sled pulled by dogs, used in snowy regions for transportation.",
    "dome": "A rounded, hemispherical structure often seen in buildings or architecture.",
    "doormat": "A mat placed at the entrance to wipe shoes on before entering.",
    "drilling rig": "A machine used for drilling holes in the earth's surface for oil or gas.",
    "drum": "A musical instrument made of a cylindrical body and a stretched membrane.",
    "drumstick": "A stick used to play drums, or a part of a chicken leg.",
    "dumbbell": "A weight used for exercising, typically with one hand.",
    "Dutch oven": "A heavy, lidded cooking pot often used for slow-cooking stews or soups.",
    "electric fan": "A device that blows air to cool down a room or individual.",
    "electric guitar": "A guitar that uses electric pickups to amplify sound.",
    "electric locomotive": "A train engine powered by electricity, used for hauling trains.",
    "entertainment center": "A piece of furniture designed to hold electronic devices like TVs and speakers.",
    "envelope": "A flat, usually rectangular paper container used for mailing letters.",
    "espresso machine": "A machine used to brew espresso coffee by forcing hot water through ground coffee.",
    "face powder": "A cosmetic product used to reduce shine and set makeup.",
    "feather boa": "A fluffy, decorative scarf made from feathers, often worn for fashion.",
    "filing cabinet": "A piece of furniture used for storing files and documents.",
    "fireboat": "A boat equipped with firefighting equipment, used to fight fires on water.",
    "fire truck": "A vehicle equipped with firefighting tools, used by firefighters to respond to fires.",
    "fire screen": "A protective screen placed in front of a fire to prevent sparks from escaping.",
    "flagpole": "A tall pole used to display flags.",
    "flute": "A woodwind musical instrument played by blowing across a hole.",
    "folding chair": "A lightweight chair that can be folded for easy storage.",
    "football helmet": "A protective helmet worn by players in American football.",
    "forklift": "A vehicle with a hydraulic lift used to move heavy materials in warehouses.",
    "fountain": "A decorative structure that releases water in a stream or spray.",
    "fountain pen": "A pen that uses liquid ink, with a nib for writing.",
    "four-poster bed": "A large bed with four posts at each corner, often with a canopy.",
    "freight car": "A train car used to carry cargo or goods.",
    "French horn": "A brass musical instrument with a coiled design, played by blowing through a mouthpiece.",
    "frying pan": "A flat cooking pan used for frying food.",
    "fur coat": "A coat made from the fur of animals, worn for warmth or fashion.",
    "garbage truck": "A truck used for collecting and transporting waste or garbage.",
    "gas mask or respirator": "A mask worn to protect against inhaling harmful gases or pollutants.",
    "gas pump": "A machine used to pump gasoline into vehicles.",
    "goblet": "A drinking glass with a stem, often used for wine or ceremonial purposes.",
    "go-kart": "A small, motorized vehicle used for racing, often in recreational settings.",
    "golf ball": "A small, white ball used in the sport of golf.",
    "golf cart": "A small vehicle used for transporting golfers and their equipment on a golf course.",
    "gondola": "A type of boat used in Venice or a cable car in ski resorts.",
    "gong": "A large, circular percussion instrument that produces a deep, resonating sound.",
    "gown": "A long, formal dress worn for special occasions.",
    "grand piano": "A large piano with a horizontal soundboard, used for classical music performances.",
    "greenhouse": "A glass building used for growing plants in a controlled environment.",
    "radiator grille": "A metal grille on a car used to protect the radiator and allow airflow.",
    "grocery store": "A store that sells food and household products.",
    "guillotine": "A device used for beheading, typically with a heavy blade.",
    "hair clip": "A small clip used to hold hair in place.",
    "hair spray": "A spray used to set or hold hair in place.",
    "half-track": "A vehicle with both wheels and tracks, used for off-road transport.",
    "hammer": "A tool with a heavy head used for striking objects.",
    "hamper": "A large basket used for storing laundry or other items.",
    "hair dryer": "An appliance used to dry hair using hot air.",
    "hand-held computer": "A small, portable computing device that can be held in one hand.",
    "handkerchief": "A small cloth used for wiping the face or hands.",
    "hard disk drive": "A device used to store digital data on spinning disks.",
    "harmonica": "A small, handheld musical instrument that is played by blowing air through it.",
    "harp": "A large stringed musical instrument played by plucking the strings.",
    "combine harvester": "A machine used to harvest crops like wheat and corn.",
    "hatchet": "A small, one-handed axe used for chopping wood.",
    "holster": "A pouch or case for carrying a firearm, usually worn on the belt.",
    "home theater": "A system of electronic devices designed to replicate a movie theater experience at home.",
    "honeycomb": "A structure of hexagonal cells built by bees to store honey.",
    "hook": "A curved tool or object used for hanging or holding items.",
    "hoop skirt": "A skirt worn underneath dresses to make them puffy and full.",
    "gymnastic horizontal bar": "A bar used in gymnastics, typically for exercises and routines.",
    "horse-drawn vehicle": "A vehicle pulled by horses, commonly used before cars.",
    "hourglass": "A device used to measure time, typically with sand flowing between two glass bulbs.",
    "iPod": "A portable media player by Apple, used for listening to music.",
    "clothes iron": "An appliance used for pressing clothes to remove wrinkles.",
    "carved pumpkin": "A pumpkin with a design or face carved into it, often seen at Halloween.",
    "jeans": "Trousers made of denim fabric, typically worn for casual occasions.",
    "jeep": "A small, rugged vehicle designed for off-road driving.",
    "T-shirt": "A casual shirt with short sleeves, often made of cotton.",
    "jigsaw puzzle": "A puzzle consisting of pieces that fit together to form a picture.",
    "rickshaw": "A small, two-wheeled vehicle pulled by a person, commonly used in Asia.",
    "joystick": "A handheld input device used to control video games or computers.",
    "kimono": "A traditional Japanese robe, often worn on formal occasions.",
    "knee pad": "A protective pad worn on the knees during physical activities.",
    "knot": "A loop tied in rope or string to secure objects.",
    "lab coat": "A white coat worn by scientists to protect clothing and maintain cleanliness.",
    "ladle": "A long-handled spoon used to serve soup or liquids.",
    "lampshade": "A cover placed over a lamp to diffuse light and protect the bulb.",
    "laptop computer": "A portable computer with a screen and keyboard.",
    "lawn mower": "A machine used for cutting grass in a yard or garden.",
    "lens cap": "A cover for a camera lens to protect it from dust and scratches.",
    "letter opener": "A tool used to open envelopes by cutting the paper.",
    "library": "A place where books and other materials are stored and made available for borrowing.",
    "lifeboat": "A small boat used for emergency evacuations, typically on ships.",
    "lighter": "A small device used to create a flame, often used for lighting cigarettes.",
    "limousine": "A large, luxurious vehicle, often used for special occasions.",
    "ocean liner": "A large ship designed for long-distance travel across oceans.",
    "lipstick": "A cosmetic product applied to the lips to add color or shine.",
    "slip-on shoe": "A type of shoe that can be worn without laces or fasteners, typically easy to slip on and off.",
    "lotion": "A creamy substance applied to the skin for moisturizing.",
    "music speaker": "A device that makes sound.",
    "loupe magnifying glass": "A small magnifying tool.",
    "sawmill": "A place where wood is cut into planks.",
    "magnetic compass": "A tool that shows direction.",
    "messenger bag": "A bag worn over the shoulder.",
    "mailbox": "A box for receiving letters.",
    "tights": "Close-fitting legwear.",
    "one-piece bathing suit": "A swimsuit that covers the torso.",
    "manhole cover": "A metal cover for a hole in the ground.",
    "maraca": "A musical instrument that is shaken.",
    "marimba": "A wooden percussion instrument.",
    "mask": "A cover for the face.",
    "matchstick": "A small stick used to start a fire.",
    "maypole": "A tall pole decorated with ribbons.",
    "maze": "A path designed to confuse people.",
    "measuring cup": "A tool for measuring ingredients.",
    "medicine cabinet": "A cupboard for storing medicines.",
    "megalith": "A large stone used in ancient structures.",
    "microphone": "A device to record or amplify sound.",
    "microwave oven": "A kitchen appliance that heats food quickly.",
    "military uniform": "Clothing worn by soldiers.",
    "milk can": "A metal container for storing milk.",
    "minibus": "A small bus that carries a few passengers.",
    "miniskirt": "A very short skirt.",
    "minivan": "A small van for families.",
    "missile": "A rocket-like weapon.",
    "mitten": "A glove that covers the whole hand.",
    "mixing bowl": "A bowl used for mixing ingredients.",
    "mobile home": "A movable house.",
    "ford model t": "An early, affordable car.",
    "modem": "A device that connects to the internet.",
    "monastery": "A building where monks live and pray.",
    "monitor": "A screen that shows computer output.",
    "moped": "A small motorized bike.",
    "mortar and pestle": "A tool for grinding substances.",
    "graduation cap": "A hat worn during graduation ceremonies.",
    "mosque": "A place of worship for Muslims.",
    "mosquito net": "A net to protect from mosquito bites.",
    "vespa": "A small motor scooter.",
    "mountain bike": "A bike designed for rough terrain.",
    "tent": "A portable shelter made of fabric.",
    "computer mouse": "A device to move a cursor on a screen.",
    "mousetrap": "A device to catch mice.",
    "moving van": "A truck used for moving things.",
    "muzzle": "A cover for an animal's nose and mouth.",
    "metal nail": "A small metal spike used to fasten things.",
    "neck brace": "A support worn to protect the neck.",
    "necklace": "A piece of jewelry worn around the neck.",
    "baby pacifier": "A rubber object for babies to suck on.",
    "notebook computer": "A portable laptop.",
    "obelisk": "A tall, four-sided stone monument.",
    "oboe": "A woodwind musical instrument.",
    "ocarina": "A small, wind-powered musical instrument.",
    "odometer": "A device that measures distance traveled.",
    "oil filter": "A device that removes impurities from oil.",
    "pipe organ": "A large musical instrument with pipes.",
    "oscilloscope": "A tool for measuring electrical signals.",
    "overskirt": "A skirt worn over another skirt.",
    "bullock cart": "A cart pulled by oxen.",
    "oxygen mask": "A mask that supplies oxygen.",
    "product packet / packaging": "A package containing a product.",
    "paddle": "A tool used to move a boat.",
    "paddle wheel": "A large wheel used for propulsion in water.",
    "padlock": "A lock that can be fastened and unlocked.",
    "paintbrush": "A tool for applying paint.",
    "pajamas": "Clothes worn for sleeping.",
    "palace": "A large, grand house for royalty.",
    "pan flute": "A musical instrument made of pipes.",
    "paper towel": "A disposable towel made of paper.",
    "parachute": "A device used to slow down a fall.",
    "parallel bars": "Gymnastics equipment for balancing.",
    "park bench": "A bench in a public park.",
    "parking meter": "A device that charges for parking.",
    "railroad car": "A vehicle that runs on tracks for transporting goods.",
    "patio": "A paved outdoor area.",
    "payphone": "A phone where you pay to make calls.",
    "pedestal": "A base or support for a statue or object.",
    "pencil case": "A small container for holding pens and pencils.",
    "pencil sharpener": "A device used to sharpen pencils.",
    "perfume": "A fragrant liquid used for scent.",
    "Petri dish": "A shallow dish used for growing cultures.",
    "photocopier": "A machine used to make copies of documents.",
    "plectrum": "A small tool used to pluck strings on instruments.",
    "Pickelhaube": "A spiked helmet worn by German soldiers.",
    "picket fence": "A type of fence made of vertical wooden slats.",
    "pickup truck": "A truck with an open cargo area.",
    "pier": "A structure extending into water for docking boats.",
    "piggy bank": "A small container for saving coins.",
    "pill bottle": "A container for holding medicine.",
    "pillow": "A soft cushion used for resting the head.",
    "ping-pong ball": "A small ball used in table tennis.",
    "pinwheel": "A toy with blades that spin in the wind.",
    "pirate ship": "A ship used by pirates.",
    "drink pitcher": "A container for holding drinks.",
    "block plane": "A tool for smoothing wood.",
    "planetarium": "A building with displays of stars and planets.",
    "plastic bag": "A bag made from plastic material.",
    "plate rack": "A rack for holding plates.",
    "farm plow": "A tool used for tilling soil on farms.",
    "plunger": "A tool used to unclog drains.",
    "Polaroid camera": "A camera that produces instant photos.",
    "pole": "A long, slender object used for support.",
    "police van": "A vehicle used by the police to transport people.",
    "poncho": "A large piece of fabric worn to protect from rain.",
    "pool table": "A table used for playing billiards.",
    "soda bottle": "A container for storing soda or beverages.",
    "plant pot": "A container used for growing plants or flowers.",
    "potter's wheel": "A spinning tool for shaping clay pottery.",
    "power drill": "A tool for drilling holes or driving screws.",
    "prayer rug": "A small rug used for praying.",
    "printer": "A machine for printing documents or images.",
    "prison": "A place for confining criminals.",
    "projector": "A device to display images or videos.",
    "hockey puck": "A puck used in ice hockey games.",
    "punching bag": "A bag for practicing punches.",
    "purse": "A small bag for carrying personal items.",
    "quill": "A feather used as a writing tool.",
    "quilt": "A thick stitched blanket for warmth.",
    "race car": "A fast car built for racing.",
    "racket": "A tool for hitting balls in sports.",
    "radiator": "A device for heating a room.",
    "radio": "A device for receiving audio broadcasts.",
    "radio telescope": "A telescope for detecting radio waves.",
    "rain barrel": "A container for collecting rainwater.",
    "recreational vehicle": "A vehicle for traveling and camping.",
    "fishing casting reel": "A reel for controlling fishing lines.",
    "reflex camera": "A camera with a mirror for previewing.",
    "refrigerator": "An appliance for keeping food cold.",
    "remote control": "A device for operating electronics wirelessly.",
    "restaurant": "A place where meals are served.",
    "revolver": "A handgun with a rotating bullet chamber.",
    "rifle": "A long gun for accurate shooting.",
    "rocking chair": "A chair that moves back and forth.",
    "rotisserie": "A device for roasting meat evenly.",
    "eraser": "A tool for removing pencil marks.",
    "rugby ball": "An oval ball used in rugby games.",
    "ruler measuring stick": "A tool used for measuring or drawing.",
    "sneaker": "A comfortable shoe for casual use.",
    "safe": "A secure box for storing valuables.",
    "safety pin": "A pin used for fastening fabric.",
    "salt shaker": "A container for sprinkling salt.",
    "sandal": "An open-toe shoe with straps.",
    "sarong": "A cloth wrap worn as a garment.",
    "saxophone": "A wind instrument used in music.",
    "scabbard": "A sheath for storing a sword.",
    "weighing scale": "A device for measuring weight.",
    "school bus": "A bus for transporting students.",
    "schooner": "A sailing ship with multiple masts.",
    "scoreboard": "A display showing game scores.",
    "CRT monitor": "An old-style computer screen.",
    "screw": "A metal fastener with threads.",
    "screwdriver": "A tool for tightening screws.",
    "seat belt": "A strap for safety in vehicles.",
    "sewing machine": "A machine for stitching fabric.",
    "shield": "A protective device for defense.",
    "shoe store": "A shop selling various shoes.",
    "shoji screen / room divider": "A Japanese-style sliding divider.",
    "shopping basket": "A basket for carrying items while shopping.",
    "shopping cart": "A wheeled cart for holding items.",
    "shovel": "A tool for digging or lifting material.",
    "shower cap": "A cap to keep hair dry while showering.",
    "shower curtain": "A curtain to prevent water splashes.",
    "ski": "A long device for gliding on snow.",
    "balaclava ski mask": "A mask for protecting the face in cold.",
    "sleeping bag": "A portable bag for sleeping outdoors.",
    "slide rule": "A tool for manual mathematical calculations.",
    "sliding door": "A door that moves sideways to open.",
    "slot machine": "A gambling machine with spinning reels.",
    "snorkel": "A tube for breathing while swimming.",
    "snowmobile": "A vehicle for traveling on snow.",
    "snowplow": "A machine for clearing snow.",
    "soap dispenser": "A device that releases liquid soap.",
    "soccer ball": "A round ball used in soccer games.",
    "sock": "Clothing for covering feet.",
    "solar thermal collector": "A device that captures sunlight for energy.",
    "sombrero": "A wide-brimmed Mexican hat.",
    "soup bowl": "A bowl for serving soup.",
    "keyboard space bar": "The long key on a keyboard.",
    "space heater": "A small device for heating rooms.",
    "space shuttle": "A spacecraft for traveling to space.",
    "spatula": "A flat tool for flipping or spreading food.",
    "motorboat": "A boat powered by an engine.",
    "spider web": "A silk structure made by spiders.",
    "spindle": "A rod for spinning fibers into thread.",
    "sports car": "A fast car for high performance.",
    "spotlight": "A focused light for highlighting objects.",
    "stage": "A platform for performances or presentations.",
    "steam locomotive": "A train powered by steam.",
    "through arch bridge": "A bridge with an arched structure.",
    "steel drum": "A metal drum used as a musical instrument.",
    "stethoscope": "A medical tool for listening to body sounds.",
    "scarf": "A fabric worn around the neck for warmth.",
    "stone wall": "A wall made of stacked stones.",
    "stopwatch": "A handheld timer for measuring time.",
    "stove": "An appliance for cooking food.",
    "strainer": "A tool to separate liquids from solids.",
    "tram": "A vehicle for public city transportation.",
    "stretcher": "A portable bed for carrying injured people.",
    "couch": "A comfortable piece of seating furniture.",
    "stupa": "A dome-shaped Buddhist monument.",
    "submarine": "A vessel that travels underwater.",
    "suit": "Formal clothing with a jacket and trousers.",
    "sundial": "A device that uses the sun to tell time.",
    "sunglasses": "Eyewear for protecting eyes from sunlight.",
    "sunscreen": "A lotion to protect skin from the sun.",
    "suspension bridge": "A bridge supported by hanging cables.",
    "mop": "A cleaning tool with absorbent material for wiping floors.",
    "sweatshirt": "A warm, long-sleeved casual garment for the upper body.",
    "swim trunks / shorts": "Shorts designed for swimming or water activities.",
    "swing": "A suspended seat that moves back and forth.",
    "electrical switch": "A device used to turn electrical circuits on or off.",
    "syringe": "A medical device for injecting or extracting fluids.",
    "table lamp": "A small lamp placed on a table for lighting.",
    "tank": "A heavily armored combat vehicle with large guns.",
    "tape player": "A device for playing audio from magnetic tapes.",
    "teapot": "A container with a spout for brewing and pouring tea.",
    "teddy bear": "A soft stuffed toy shaped like a bear.",
    "television": "An electronic device for viewing video broadcasts.",
    "tennis ball": "A small, bouncy ball used in tennis games.",
    "thatched roof": "A roof made from dried plant materials like straw.",
    "front curtain": "A curtain covering the front of a stage in theaters.",
    "thimble": "A small metal cap worn to protect fingers when sewing.",
    "threshing machine": "A machine for separating grain from stalks.",
    "throne": "An ornate chair for royalty or ceremonial use.",
    "tile roof": "A roof covered with overlapping ceramic tiles.",
    "toaster": "An appliance for browning bread slices.",
    "tobacco shop": "A store selling cigars, cigarettes, and tobacco products.",
    "toilet seat": "A hinged seat on top of a toilet bowl.",
    "torch": "A portable light source, usually powered by batteries or fire.",
    "totem pole": "A carved wooden pole representing cultural symbols or stories.",
    "tow truck": "A vehicle for towing broken or disabled cars.",
    "toy store": "A store selling toys for children.",
    "tractor": "A powerful vehicle used in farms for pulling equipment.",
    "semi-trailer truck": "A large truck for transporting heavy cargo.",
    "tray": "A flat, shallow surface for carrying items.",
    "trench coat": "A long, waterproof coat with a belt and buttons.",
    "tricycle": "A three-wheeled vehicle, often for children.",
    "trimaran": "A boat with three parallel hulls.",
    "tripod": "A three-legged stand for cameras or other equipment.",
    "triumphal arch": "A monumental arch celebrating victories or events.",
    "trolleybus": "An electric bus powered by overhead wires.",
    "trombone": "A brass instrument with a sliding tube for changing pitch.",
    "hot tub": "A heated pool or tub for relaxation or therapy.",
    "turnstile": "A rotating gate that controls entry to a place.",
    "typewriter keyboard": "A keyboard on a manual or electric typewriter.",
    "umbrella": "A collapsible canopy for protection from rain or sun.",
    "unicycle": "A one-wheeled vehicle ridden by balancing.",
    "upright piano": "A vertical piano for playing music indoors.",
    "vacuum cleaner": "A device for cleaning using suction power.",
    "vase": "A decorative container for holding flowers or plants.",
    "vaulted or arched ceiling": "A ceiling with curved or arched structure.",
    "velvet fabric": "A soft, plush fabric with a smooth texture.",
    "vending machine": "A machine that dispenses items like snacks or drinks.",
    "vestment": "A ceremonial robe worn by clergy or officials.",
    "viaduct": "A bridge-like structure for roads or railways over valleys.",
    "violin": "A string instrument played with a bow.",
    "volleyball": "A ball used in the sport of volleyball.",
    "waffle iron": "A device for cooking waffles with patterned grids.",
    "wall clock": "A clock mounted on a wall to show time.",
    "wallet": "A small folding case for holding money and cards.",
    "wardrobe": "A tall cabinet for storing clothes.",
    "military aircraft": "An aircraft designed for combat or military operations.",
    "sink": "A basin with faucets for washing hands or dishes.",
    "washing machine": "An appliance for cleaning clothes and fabrics.",
    "water bottle": "A portable container for carrying water.",
    "water jug": "A container for storing and pouring water.",
    "water tower": "A tall structure for storing and supplying water.",
    "whiskey jug": "A ceramic container for storing whiskey.",
    "whistle": "A small tool for producing a high-pitched sound.",
    "hair wig": "Artificial hair worn to cover the head.",
    "window screen": "A mesh covering to block insects while allowing airflow.",
    "window shade": "A covering used to block light from windows.",
    "Windsor tie": "A formal necktie knot for suits or dress shirts.",
    "wine bottle": "A glass bottle used to store wine.",
    "airplane wing": "A wing of an aircraft for generating lift.",
    "wok": "A round-bottomed pan used for stir-frying food.",
    "wooden spoon": "A spoon made of wood used for cooking or stirring.",
    "wool": "A fabric made from the fleece of sheep.",
    "split-rail fence": "A wooden fence made from split logs.",
    "shipwreck": "The remains of a ship destroyed at sea.",
    "sailboat": "A boat propelled by sails using wind power.",
    "yurt": "A portable, round tent used by nomads.",
    "website": "A collection of related web pages on the internet.",
    "comic book": "A book with illustrations telling a story in panels.",
    "crossword": "A word puzzle with intersecting horizontal and vertical clues.",
    "traffic or street sign": "A sign providing information or instructions for drivers.",
    "traffic light": "A signal with colored lights directing vehicle movement.",
    "dust jacket": "A removable paper cover for a book.",
    "menu": "A list of dishes available at a restaurant.",
    "plate": "A flat dish used for serving food.",
    "guacamole": "A dip made from mashed avocados, lime, and spices.",
    "consomme": "A clear soup made from concentrated stock or broth.",
    "hot pot": "A communal meal cooked in a pot at the table.",
    "trifle": "A layered dessert with cake, fruit, and cream.",
    "ice cream": "A frozen dessert made from milk and sugar.",
    "popsicle": "A frozen treat on a stick made from juice or cream.",
    "baguette": "A long, thin loaf of French bread.",
    "bagel": "A round bread roll with a hole in the center.",
    "pretzel": "A baked bread snack shaped into a twisted knot.",
    "cheeseburger": "A hamburger topped with melted cheese.",
    "hot dog": "A cooked sausage served in a sliced bun.",
    "mashed potatoes": "Potatoes boiled, mashed, and mixed with butter or cream.",
    "cabbage": "A leafy green vegetable with a dense round head.",
    "broccoli": "A green vegetable with tree-like edible florets.",
    "cauliflower": "A white vegetable with tightly packed florets.",
    "zucchini": "A green summer squash used in cooking.",
    "spaghetti squash": "A squash that separates into strands when cooked.",
    "acorn squash": "A small squash with a hard, ribbed shell.",
    "butternut squash": "A large, sweet squash with a tan skin.",
    "cucumber": "A long, green vegetable often eaten raw.",
    "artichoke": "A green vegetable with a spiky outer layer.",
    "bell pepper": "A colorful, bell-shaped vegetable.",
    "cardoon": "A thistle-like vegetable with edible stalks.",
    "mushroom": "A fungus with a cap and stem.",
    "Granny Smith apple": "A green, tart apple.",
    "strawberry": "A small red fruit with tiny seeds.",
    "orange": "A round, orange citrus fruit.",
    "lemon": "A sour, yellow citrus fruit.",
    "fig": "A sweet, pear-shaped fruit.",
    "pineapple": "A large, spiky fruit with sweet flesh.",
    "banana": "A long, yellow fruit.",
    "jackfruit": "A large fruit with a tough outer skin and sweet flesh.",
    "cherimoya (custard apple)": "A green, heart-shaped fruit with soft, sweet flesh.",
    "pomegranate": "A red fruit with many juicy seeds inside.",
    "hay": "Dried grass used as animal feed.",
    "carbonara": "An Italian pasta dish with eggs, cheese, and bacon.",
    "chocolate syrup": "A sweet, chocolate-flavored liquid.",
    "dough": "Uncooked mixture of flour and water used in baking.",
    "meatloaf": "A dish made from ground meat and seasonings, shaped into a loaf.",
    "pizza": "A round flatbread topped with sauce, cheese, and toppings.",
    "pot pie": "A pie filled with meat, vegetables, and gravy.",
    "burrito": "A Mexican dish with a flour tortilla filled with various ingredients.",
    "red wine": "A type of wine made from dark-colored grapes.",
    "espresso": "A strong, concentrated coffee served in small amounts.",
    "tea cup": "A small cup used for drinking tea.",
    "eggnog": "A creamy drink made with eggs, milk, and spices, often served at Christmas.",
    "mountain": "A large, steep landform that rises above its surroundings.",
    "bubble": "A thin film of soapy water filled with air.",
    "cliff": "A steep, vertical rock face.",
    "coral reef": "A underwater ecosystem made up of coral and marine life.",
    "geyser": "A hot spring that periodically shoots water and steam into the air.",
    "lakeshore": "The land next to a lake.",
    "promontory": "A high point of land that juts out into the sea.",
    "sandbar": "A shallow area of sand in a body of water.",
    "beach": "A shore of a body of water, usually covered with sand.",
    "valley": "A low area between hills or mountains, often with a river.",
    "volcano": "A mountain with an opening at the top through which lava erupts.",
    "baseball player": "An athlete who plays baseball.",
    "bridegroom": "A man on his wedding day.",
    "scuba diver": "A person who swims underwater with a breathing apparatus.",
    "rapeseed": "A plant whose seeds are used to make oil.",
    "daisy": "A small flower with white petals and a yellow center.",
    "yellow lady's slipper": "A yellow flower shaped like a slipper.",
    "corn": "A tall plant with large yellow kernels.",
    "acorn": "A small, brown nut from an oak tree.",
    "rose hip": "The fruit of a rose plant.",
    "horse chestnut seed": "A shiny brown seed from a horse chestnut tree.",
    "coral fungus": "A type of fungus that looks like coral.",
    "agaric": "A type of mushroom with a cap and stem.",
    "gyromitra": "A type of mushroom known for its unusual shape.",
    "stinkhorn mushroom": "A smelly, mushroom-like fungus.",
    "earth star fungus": "A type of fungus that resembles a star.",
    "hen of the woods mushroom": "A type of mushroom that grows in clusters and looks like feathers.",
    "bolete": "A type of mushroom with a thick stem and sponge-like pores.",
    "corn cob": "The central part of an ear of corn.",
    "toilet paper": "Soft paper used in bathrooms."
}