{
    "goldfish": "A small, golden-colored freshwater fish.",
    "great white shark": "A large, predatory shark with sharp teeth.",
    "hammerhead shark": "A shark with a hammer-shaped head.",
    "stingray": "A flat fish with a long, venomous tail.",
    "hen": "A female chicken, often laying eggs.",
    "ostrich": "A large flightless bird with long legs.",
    "goldfinch": "A small songbird with yellow and black feathers.",
    "junco": "A small bird with gray or brown feathers.",
    "bald eagle": "A large bird of prey with a white head.",
    "vulture": "A large bird that feeds on carrion.",
    "smooth newt": "A small amphibian with smooth skin.",
    "axolotl": "A salamander that retains its gills throughout life.",
    "tree frog": "A small frog that lives in trees.",
    "green iguana": "A large green lizard often kept as a pet.",
    "chameleon": "A lizard known for changing its skin color.",
    "Indian cobra": "A venomous snake with a hooded appearance.",
    "scorpion": "An arachnid with pincers and a venomous sting.",
    "tarantula": "A large, hairy spider.",
    "centipede": "A multi-legged arthropod with venomous claws.",
    "peafowl": "A bird known for its colorful tail feathers.",
    "lorikeet": "A small, colorful parrot with a brush-tipped tongue.",
    "hummingbird": "A tiny bird that hovers while feeding on nectar.",
    "toucan": "A bird with a large, colorful beak.",
    "duck": "A waterfowl with webbed feet and a broad bill.",
    "goose": "A large waterfowl with a long neck.",
    "black swan": "A large waterbird with black feathers.",
    "koala": "A tree-dwelling marsupial that eats eucalyptus leaves.",
    "jellyfish": "A soft-bodied marine animal with tentacles.",
    "snail": "A mollusk with a coiled shell.",
    "American lobster": "A large crustacean with big claws.",
    "hermit crab": "A crab that lives in a discarded shell.",
    "flamingo": "A tall bird with pink feathers and long legs.",
    "great egret": "A large white heron with long legs.",
    "pelican": "A large water bird with a long beak and throat pouch.",
    "king penguin": "A large penguin with bright orange markings.",
    "grey whale": "A large baleen whale with a gray body.",
    "killer whale": "A large, black-and-white predatory whale.",
    "sea lion": "A marine mammal with external ear flaps.",
    "Chihuahua": "A small dog breed with a short coat.",
    "Shih Tzu": "A small dog with a long, flowing coat.",
    "Afghan Hound": "A tall dog with long, flowing fur.",
    "Basset Hound": "A dog with long ears and short legs.",
    "Beagle": "A small hound dog with a keen sense of smell.",
    "Bloodhound": "A large dog known for its strong tracking abilities.",
    "Italian Greyhound": "A small, slender dog with a short coat.",
    "Whippet": "A small, fast dog resembling a greyhound.",
    "Weimaraner": "A large, sleek dog with a gray coat.",
    "Yorkshire Terrier": "A small dog with a long, silky coat.",
    "Boston Terrier": "A small, muscular dog with a short coat.",
    "Scottish Terrier": "A small dog with a wiry coat and pointed ears.",
    "West Highland White Terrier": "A small terrier with a white, wiry coat.",
    "Golden Retriever": "A large dog with a thick, golden coat.",
    "Labrador Retriever": "A large dog with a short coat, known for retrieving.",
    "Cocker Spaniel": "A small spaniel with a long, silky coat.",
    "collie": "A medium-sized herding dog with a long or short coat.",
    "Border Collie": "A medium-sized herding dog known for its intelligence.",
    "Rottweiler": "A large, strong dog with a black and tan coat.",
    "German Shepherd Dog": "A large, intelligent herding dog.",
    "Boxer": "A medium-large, muscular dog with a short coat.",
    "French Bulldog": "A small, muscular dog with bat-like ears.",
    "St. Bernard": "A large, gentle dog known for its rescue work in the mountains.",
    "Siberian Husky": "A medium-sized sled dog with a thick coat.",
    "Dalmatian": "A medium-sized dog with a white coat covered in black spots.",
    "pug": "A small dog with a wrinkled face and short coat.",
    "Pomeranian": "A small, fluffy dog with a thick coat.",
    "Chow Chow": "A medium-sized dog with a thick coat and blue-black tongue.",
    "Pembroke Welsh Corgi": "A small herding dog with short legs and no tail.",
    "Toy Poodle": "The smallest variety of poodle, with a curly coat.",
    "Standard Poodle": "The largest poodle breed with a curly coat.",
    "grey wolf": "The largest wild member of the dog family.",
    "hyena": "A large carnivore known for its powerful jaws.",
    "red fox": "A small wild canid with a red coat.",
    "tabby cat": "A domestic cat with a striped coat.",
    "leopard": "A large wild cat with a spotted coat.",
    "snow leopard": "A large wild cat adapted to cold, mountainous regions.",
    "lion": "A large wild cat known for its mane.",
    "tiger": "A large wild cat with a striped coat.",
    "cheetah": "A large wild cat known for its speed.",
    "polar bear": "A large bear species adapted to the Arctic.",
    "meerkat": "A small, social mammal that lives in desert regions.",
    "ladybug": "A small beetle with a red and black-spotted shell.",
    "fly": "A small insect with two wings.",
    "bee": "An insect known for pollination and honey production.",
    "ant": "A small social insect that lives in colonies.",
    "grasshopper": "An insect that jumps and feeds on plants.",
    "cockroach": "A nocturnal insect known for its hardiness.",
    "praying mantis": "An insect known for its predatory hunting stance.",
    "dragonfly": "A fast-flying insect with long, slender wings.",
    "monarch butterfly": "A large, orange and black migratory butterfly.",
    "starfish": "A sea creature with five arms.",
    "cottontail rabbit": "A small rabbit with a fluffy white tail.",
    "porcupine": "A rodent with sharp quills for defense.",
    "fox squirrel": "A large tree squirrel with a bushy tail.",
    "beaver": "A large rodent known for building dams.",
    "guinea pig": "A small, social rodent often kept as a pet.",
    "zebra": "A wild horse with black and white stripes.",
    "pig": "A domesticated animal raised for meat.",
    "hippopotamus": "A large, semi-aquatic mammal with a huge mouth.",
    "bison": "A large, shaggy wild bovine.",
    "gazelle": "A small, slender antelope.",
    "llama": "A domesticated South American pack animal.",
    "skunk": "A small mammal known for its foul-smelling spray.",
    "badger": "A burrowing mammal with a strong build.",
    "orangutan": "A large, orange-colored ape.",
    "gorilla": "A large, powerful ape.",
    "chimpanzee": "A highly intelligent ape closely related to humans.",
    "gibbon": "A small, agile ape known for its long arms.",
    "baboon": "A large, ground-dwelling monkey.",
    "giant panda": "A large bear-like mammal known for eating bamboo.",
    "eel": "A long, snake-like fish.",
    "clownfish": "A small, colorful fish that lives in anemones.",
    "pufferfish": "A fish that inflates when threatened.",
    "accordion": "A portable musical instrument with keys and bellows.",
    "ambulance": "A vehicle used to transport people in need of medical care.",
    "assault rifle": "A rapid-fire rifle designed for military use.",
    "backpack": "A bag worn on the back, used for carrying items.",
    "barn": "A large building used for storing farm equipment and animals.",
    "wheelbarrow": "A small hand-propelled vehicle for carrying loads.",
    "basketball": "A large ball used in the sport of basketball.",
    "bathtub": "A large container for taking baths.",
    "lighthouse": "A tall structure with a light to guide ships.",
    "beer glass": "A glass used for drinking beer.",
    "binoculars": "A handheld device for viewing distant objects.",
    "birdhouse": "A small house for birds to live in.",
    "bow tie": "A short, ribbon-like necktie.",
    "broom": "A tool used for sweeping floors.",
    "bucket": "A round container with a handle, used for carrying liquids.",
    "cauldron": "A large metal pot used for cooking over an open fire.",
    "candle": "A stick of wax with a wick, used for lighting.",
    "cannon": "A large gun used in warfare.",
    "canoe": "A lightweight boat paddled by hand.",
    "carousel": "A rotating amusement ride with seats for passengers.",
    "castle": "A large fortified building or group of buildings.",
    "mobile phone": "A handheld device used for communication.",
    "cowboy hat": "A wide-brimmed hat associated with cowboys.",
    "electric guitar": "A guitar that requires an amplifier to produce sound.",
    "fire truck": "A vehicle used by firefighters to fight fires.",
    "flute": "A woodwind instrument played by blowing air.",
    "gas mask or respirator": "A mask worn to protect from harmful gases.",
    "grand piano": "A large, full-size piano.",
    "guillotine": "A machine used for execution by beheading.",
    "hammer": "A tool used for driving nails into materials.",
    "harmonica": "A small wind instrument played by blowing air.",
    "harp": "A large string instrument played by plucking.",
    "hatchet": "A small axe used for chopping.",
    "jeep": "A rugged, off-road vehicle.",
    "joystick": "A control stick used for video games or machines.",
    "lab coat": "A protective coat worn by scientists or doctors.",
    "lawn mower": "A machine used to cut grass.",
    "lipstick": "A cosmetic used to color the lips.",
    "mailbox": "A box where mail is collected and delivered.",
    "missile": "guided weapon designed to hit a target",
    "mitten": "A glove that covers the hand with a single space for fingers.",
    "parachute": "device used to slow a fall from the sky",
    "pickup truck": "vehicle with an open cargo area",
    "pirate ship": "vessel used by pirates for sailing and attacking",
    "revolver": "handgun with a revolving cylinder",
    "rugby ball": "oval ball used in the sport of rugby",
    "sandal": "open-toe footwear with straps",
    "saxophone": "wind instrument used in jazz and classical music",
    "school bus": "vehicle for transporting students",
    "schooner": "large sailing ship with multiple masts",
    "shield": "protective device used in combat",
    "soccer ball": "round ball used in the sport of soccer",
    "space shuttle": "vehicle used for traveling to space",
    "spider web": "silk structure created by spiders",
    "steam locomotive": "train engine powered by steam",
    "scarf": "garment worn around the neck for warmth or style",
    "submarine": "underwater vessel",
    "tank": "armored military vehicle with a large gun",
    "tennis ball": "small rubber ball used in tennis",
    "tractor": "vehicle used in farming to pull machinery",
    "trombone": "brass instrument with a sliding mechanism",
    "vase": "container used for holding flowers",
    "violin": "stringed instrument played with a bow",
    "military aircraft": "aircraft used by the military for combat or transport",
    "wine bottle": "A bottle for holding wine.",
    "ice cream": "A frozen dessert made from cream.",
    "bagel": "A round bread roll with a hole in the middle.",
    "pretzel": "A twisted, baked bread snack.",
    "cheeseburger": "A hamburger with cheese.",
    "hot dog": "A sausage in a bun.",
    "cabbage": "A leafy vegetable, often green or purple.",
    "broccoli": "A green vegetable with a tree-like shape.",
    "cucumber": "A long, green vegetable often used in salads.",
    "bell pepper": "A sweet, crunchy pepper available in different colors.",
    "mushroom": "A fungus with a stalk and cap.",
    "Granny Smith apple": "A tart, green apple variety.",
    "strawberry": "A small, red, sweet fruit with seeds on the outside.",
    "lemon": "A yellow, sour citrus fruit.",
    "pineapple": "A tropical fruit with spiky skin and sweet flesh.",
    "banana": "A long, curved fruit with soft, sweet flesh.",
    "pomegranate": "A fruit with a tough rind and juicy seeds inside.",
    "pizza": "A dish of dough topped with sauce, cheese, and toppings.",
    "burrito": "A tortilla wrapped around a filling.",
    "espresso": "A strong, concentrated coffee.",
    "volcano": "A mountain that erupts with lava.",
    "baseball player": "A person who plays baseball.",
    "scuba diver": "A person who dives underwater with breathing equipment.",
    "acorn": "A nut from an oak tree."
}