{
    "pink primrose": "A delicate pink flower with a rosette shape.",
    "hard-leaved pocket orchid": "A small orchid with tough, glossy leaves.",
    "canterbury bells": "A bell-shaped flower with vibrant colors.",
    "sweet pea": "A fragrant flower with soft, wavy petals.",
    "english marigold": "A bright orange or yellow flower with many layers.",
    "tiger lily": "An orange flower with black spots, resembling a tiger.",
    "moon orchid": "A white orchid with a round, moon-like appearance.",
    "bird of paradise": "A striking flower that resembles a colorful bird.",
    "monkshood": "A tall flower with a hood-like, deep purple bloom.",
    "globe thistle": "A round, spiky flower with a metallic blue color.",
    "snapdragon": "A tall flower with dragon-like, tubular blooms.",
    "colt's foot": "A yellow, dandelion-like flower that blooms early.",
    "king protea": "A large, crown-like flower with stiff petals.",
    "spear thistle": "A tall, spiky plant with purple blooms.",
    "yellow iris": "A bright yellow flower with tall, sword-shaped leaves.",
    "globe-flower": "A round, bright yellow flower resembling a globe.",
    "purple coneflower": "A spiky, purple flower with a raised center.",
    "peruvian lily": "A colorful, spotted flower with long petals.",
    "balloon flower": "A puffy, balloon-shaped flower that bursts open.",
    "giant white arum lily": "A large, elegant white flower with a yellow center.",
    "fire lily": "A bright red-orange flower with a flame-like appearance.",
    "pincushion flower": "A round flower with needle-like projections.",
    "fritillary": "A bell-shaped flower with a checkered pattern.",
    "red ginger": "A tall, red flower with vibrant spikes.",
    "grape hyacinth": "A cluster of small, purple bell-shaped flowers.",
    "corn poppy": "A bright red flower with delicate, crinkled petals.",
    "prince of wales feathers": "A feathery plant with tall, plume-like blooms.",
    "stemless gentian": "A small, deep blue flower that grows close to the ground.",
    "artichoke": "A large, thistle-like flower known for its edible buds.",
    "sweet william": "A colorful, fragrant flower with fringed petals.",
    "carnation": "A ruffled flower in a variety of colors.",
    "garden phlox": "A fragrant, multi-petaled flower in large clusters.",
    "love in the mist": "A delicate blue flower surrounded by fine, misty foliage.",
    "mexican aster": "A bright, daisy-like flower with long petals.",
    "alpine sea holly": "A spiky, blue-purple flower with stiff leaves.",
    "ruby-lipped cattleya": "A large, showy orchid with vibrant ruby lips.",
    "cape flower": "A colorful flower with a daisy-like shape.",
    "great masterwort": "A star-shaped flower with layers of tiny blooms.",
    "siam tulip": "A pink flower with soft, tulip-like petals.",
    "lenten rose": "A winter-blooming flower with rose-like petals.",
    "barbeton daisy": "A bright, daisy-like flower with bold colors.",
    "daffodil": "A yellow or white flower with a trumpet-shaped center.",
    "sword lily": "A tall flower with long, sword-like leaves and blooms.",
    "poinsettia": "A bright red or white flower popular during winter.",
    "bolero deep blue": "A deep blue flower with a star-shaped bloom.",
    "wallflower": "A fragrant flower that grows on walls or cliffs.",
    "marigold": "A bright orange or yellow flower with ruffled petals.",
    "buttercup": "A small, shiny yellow flower with cup-shaped petals.",
    "oxeye daisy": "A large, white daisy with a yellow center.",
    "common dandelion": "A yellow flower with fluffy, white seed heads.",
    "petunia": "A trumpet-shaped flower in many colors.",
    "wild pansy": "A small, colorful flower with heart-shaped petals.",
    "primula": "A low-growing plant with clusters of bright flowers.",
    "sunflower": "A tall flower with a large, yellow bloom and edible seeds.",
    "pelargonium": "A colorful, fragrant flower with rounded petals.",
    "bishop of llandaff": "A bright red, dahlia-like flower with dark leaves.",
    "gaura": "A delicate, butterfly-like flower with white or pink blooms.",
    "geranium": "A bright, round flower with ruffled petals.",
    "orange dahlia": "A vibrant orange flower with layered, pointed petals.",
    "pink-yellow dahlia": "A large flower with pink and yellow petals.",
    "cautleya spicata": "A red and yellow flower with long, spiky blooms.",
    "japanese anemone": "A delicate, pink or white flower with a yellow center.",
    "black-eyed susan": "A yellow flower with a dark brown center.",
    "silverbush": "A silver-leaved plant with small, white flowers.",
    "californian poppy": "A bright orange flower with delicate petals.",
    "osteospermum": "A daisy-like flower with colorful petals and a blue center.",
    "spring crocus": "A small, purple or white flower that blooms in early spring.",
    "bearded iris": "A tall flower with ruffled petals and a distinct 'beard.'",
    "windflower": "A delicate, wind-tossed flower in shades of white and pink.",
    "tree poppy": "A large, white poppy with a yellow center.",
    "gazania": "A colorful, daisy-like flower that blooms in sunlight.",
    "azalea": "A small, bright flower that grows in bushes.",
    "water lily": "A floating flower with large petals, found in ponds.",
    "rose": "A fragrant, layered flower in various colors.",
    "thorn apple": "A spiky, white flower with large leaves.",
    "morning glory": "A trumpet-shaped flower that blooms in the morning.",
    "passion flower": "A complex, exotic flower with vibrant colors.",
    "lotus": "A large, water-dwelling flower with broad petals.",
    "toad lily": "A spotted, orchid-like flower with a delicate appearance.",
    "anthurium": "A glossy, red flower with a heart-shaped bloom.",
    "frangipani": "A fragrant, white or pink flower with a tropical feel.",
    "clematis": "A climbing flower with large, showy blooms.",
    "hibiscus": "A large, colorful flower with a prominent stamen.",
    "columbine": "A delicate, bell-shaped flower with spurred petals.",
    "desert-rose": "A thick-stemmed plant with bright, rose-like flowers.",
    "tree mallow": "A tall, pink or purple flower with a hollyhock-like appearance.",
    "magnolia": "A large, fragrant flower that grows on trees.",
    "cyclamen": "A small, pink or white flower with upturned petals.",
    "watercress": "A small, edible plant with tiny white flowers.",
    "canna lily": "A bright, tropical flower with large, colorful blooms.",
    "hippeastrum": "A large, trumpet-shaped flower in bright colors.",
    "bee balm": "A bright, spiky flower that attracts bees.",
    "ball moss": "A small, round plant that clings to trees.",
    "foxglove": "A tall flower with bell-shaped blooms.",
    "bougainvillea": "A colorful, flowering vine with papery blooms.",
    "camellia": "A large, rose-like flower that blooms in winter.",
    "mallow": "A small, colorful flower with a hibiscus-like shape.",
    "mexican petunia": "A purple, trumpet-shaped flower with long stems.",
    "bromelia": "A tropical plant with a bright, spiky flower.",
    "blanket flower": "A daisy-like flower with red and yellow petals.",
    "trumpet creeper": "A climbing plant with large, trumpet-shaped flowers.",
    "blackberry lily": "A bright orange flower with black seeds."
}
