{
    "abyssinian": "A sleek, short-haired cat with large ears.",
    "american bulldog": "A strong, muscular dog breed with a stocky build.",
    "american pit bull terrier": "A medium-sized, muscular dog known for its strength.",
    "basset hound": "A short-legged, long-eared dog with a strong sense of smell.",
    "beagle": "A small hound dog known for its excellent tracking abilities.",
    "bengal": "A spotted, wild-looking cat breed with a sleek coat.",
    "birman": "A long-haired, blue-eyed cat with white paws.",
    "bombay": "A sleek, black cat with copper eyes resembling a mini panther.",
    "boxer": "A muscular, medium-sized dog breed with a square muzzle.",
    "british shorthair": "A large, round-faced cat with a plush coat.",
    "chihuahua": "A tiny dog breed with large ears and a lively personality.",
    "egyptian mau": "A spotted cat with a graceful, slender body.",
    "english cocker spaniel": "A medium-sized dog with long ears and a silky coat.",
    "english setter": "A medium to large dog with a speckled coat and long ears.",
    "german shorthaired": "A versatile hunting dog with a short, sleek coat.",
    "great pyrenees": "A large, fluffy dog known for its protective nature.",
    "havanese": "A small, sturdy dog with a long, silky coat.",
    "japanese chin": "A small dog breed with a flat face and fluffy coat.",
    "keeshond": "A medium-sized dog with a thick, gray coat and a fox-like face.",
    "leonberger": "A giant dog breed with a lion-like appearance.",
    "maine coon": "A large, fluffy cat with a thick tail and tufted ears.",
    "miniature pinscher": "A small, sleek dog breed with a lively personality.",
    "newfoundland": "A large, water-loving dog with a thick, heavy coat.",
    "persian": "A long-haired, flat-faced cat with a luxurious coat.",
    "pomeranian": "A small, fluffy dog with a foxy face and a thick coat.",
    "pug": "A small dog with a wrinkled face and a curly tail.",
    "ragdoll": "A large, blue-eyed cat with a soft, silky coat.",
    "russian blue": "A slender, blue-gray cat with striking green eyes.",
    "saint bernard": "A giant dog breed known for its rescue work in the Alps.",
    "samoyed": "A fluffy, white dog with a constant smile.",
    "scottish terrier": "A small dog with a distinctive beard and wiry coat.",
    "shiba inu": "A small, fox-like dog breed from Japan with a curly tail.",
    "siamese": "A sleek cat with blue eyes and a short coat.",
    "sphynx": "A hairless cat breed with large ears and wrinkled skin.",
    "staffordshire bull terrier": "A muscular, stocky dog breed with a broad head.",
    "wheaten terrier": "A medium-sized dog with a soft, curly coat.",
    "yorkshire terrier": "A small, energetic dog with a silky coat and perky ears."
}
